[
  {
    "title": "Principal Software Development Engineer",
    "company": "USQ0 Revvity Signals Software, Inc.",
    "location": "USA",
    "description": "This description is a summary of our understanding of the job description. Click on 'Apply' button to find out more. Role Description This role involves extending a product from its market-leading position as desktop drawing software to a leading position as software and tools for Chemists and Biologists on the Signals Online Platform. Owning the architecture and design of the ChemDraw desktop suite and the online drawing, sharing and collaboration tools Extending more of the desktop functionali...",
    "url": "https://remotive.com/remote-jobs/software-dev/principal-software-development-engineer-2017193",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-06-08T00:50:07",
    "source": "remotive_api",
    "external_id": "2017193",
    "fetched_at": "2025-06-10T09:00:20.938699"
  },
  {
    "title": "Senior Software Engineer, SDET",
    "company": "202 - GoTo Technologies Hungary Kft.",
    "location": "Hungary",
    "description": "This description is a summary of our understanding of the job description. Click on 'Apply' button to find out more. Role Description As a Senior Software Test Engineer (SDET), your main responsibilities would revolve around: Test planning, test automation, test execution, analysis, collaboration, and continuous improvement at GoTo. Increasing the bandwidth of team’s delivery speed by modernizing and maintaining test automation frameworks and test suites across various cross-functional teams. De...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-software-engineer-sdet-2017090",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-06-07T20:50:43",
    "source": "remotive_api",
    "external_id": "2017090",
    "fetched_at": "2025-06-10T09:00:20.938707"
  },
  {
    "title": "Principal Data Engineer",
    "company": "The Nuclear Company",
    "location": "USA",
    "description": "The Nuclear Company is the fastest growing startup in the nuclear and energy space creating a never before seen fleet-scale approach to building nuclear reactors. Through its design-once, build-many approach and coalition building across communities, regulators, and financial stakeholders, The Nuclear Company is committed to delivering safe and reliable electricity at the lowest cost, while catalyzing the nuclear industry toward rapid development in America and globally. About the role: The Nucl...",
    "url": "https://remotive.com/remote-jobs/software-dev/principal-data-engineer-2017091",
    "salary": "$198,000 - $228,000 annually",
    "job_type": "Full-time",
    "posted_date": "2025-06-07T20:50:40",
    "source": "remotive_api",
    "external_id": "2017091",
    "fetched_at": "2025-06-10T09:00:20.938712"
  },
  {
    "title": "Junior Full Stack JavaScript Developer",
    "company": "Sigma Software",
    "location": "Europe",
    "description": "Company DescriptionWe are seeking a motivated, proactive and positive individual with a great desire to learn to join our team. You will work together with our specialists along with close collaboration with the client.The project requires development of an application related to the processing the information regarding the orders (Front-end part development, caching and Back-end)If you are passionate about your work and strive to solve complex tasks, we would be happy to welcome you to the team...",
    "url": "https://remotive.com/remote-jobs/software-dev/junior-full-stack-javascript-developer-2017093",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-06-07T16:50:35",
    "source": "remotive_api",
    "external_id": "2017093",
    "fetched_at": "2025-06-10T09:00:20.938717"
  },
  {
    "title": "Senior Software Engineer",
    "company": "Big Viking Games",
    "location": "Canada",
    "description": "LocationThis 100% remote role is only available to current residents of Ontario, who are eligible to work in Canada (citizens, permanent residents, valid existing work permits). A Little About UsMaking fans - That’s what we’re all about! Since our humble beginnings in 2011, these two words have driven Big Viking Games to become the successful company it is today. We are focused on making our mark as a next-generation, live operations games company.We believe that each Viking is unique and brings...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-software-engineer-2017195",
    "salary": "$120,000 - $140,000 cad annually",
    "job_type": "Full-time",
    "posted_date": "2025-06-07T04:50:29",
    "source": "remotive_api",
    "external_id": "2017195",
    "fetched_at": "2025-06-10T09:00:20.938722"
  },
  {
    "title": "Senior NetSuite Developer",
    "company": "Parkar Digital",
    "location": "USA",
    "description": "Job Title: Senior NetSuite Developer Location: Remote (US-Based) Employment Type: Long Term Contract About the Role: We are seeking an experienced Senior NetSuite Developer to join our remote technical team in the US. This role plays a critical part in enhancing and supporting our NetSuite ecosystem, with a strong emphasis on Advanced Revenue Management (ARM), system integrations, and scalable business processes. The ideal candidate will possess a deep understanding of NetSuite's revenue recogni...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-netsuite-developer-2016657",
    "salary": "",
    "job_type": "Contract",
    "posted_date": "2025-06-06T22:50:32",
    "source": "remotive_api",
    "external_id": "2016657",
    "fetched_at": "2025-06-10T09:00:20.938726"
  },
  {
    "title": "Full Stack Developer",
    "company": "Practice Better",
    "location": "USA, Canada",
    "description": "At Practice Better, we believe health and wellness practitioners deserve a platform that fully supports both their clients and their business. That’s why we’re building the #1 all-in-one EHR designed specifically for holistic health practitioners, giving them the tools to seamlessly run their practice, deliver personalized care, and scale their impact. Founded in 2016 and built by practitioners, for practitioners, we’ve grown into a global platform serving tens of thousands of health and wellnes...",
    "url": "https://remotive.com/remote-jobs/software-dev/full-stack-developer-2017343",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-06-06T22:50:32",
    "source": "remotive_api",
    "external_id": "2017343",
    "fetched_at": "2025-06-10T09:00:20.938731"
  },
  {
    "title": "Software Engineer",
    "company": "datma",
    "location": "USA",
    "description": "At datma, we believe that the tools we have today are insufficient to extract the tremendous latent value sitting in healthcare data. Healthcare data is growing exponentially in scale and complexity. To solve this problem, datma has developed a platform technology and associated software capable of ingesting, aggregating, harmonizing, and visualizing heterogeneous, multimodal healthcare data. The company provides the tools necessary to analyze these data at the individual or cohort level and at ...",
    "url": "https://remotive.com/remote-jobs/software-dev/software-engineer-2016760",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-06-06T22:50:31",
    "source": "remotive_api",
    "external_id": "2016760",
    "fetched_at": "2025-06-10T09:00:20.938736"
  },
  {
    "title": "Senior Data Engineer",
    "company": "Quanata",
    "location": "USA",
    "description": "To help keep everyone safe, we encourage all applicants to pay close attention to protect themselves during their job search. When applying for a position online you are at risk of being targeted by malicious actors looking for personal data. Please be aware we will only reach out via email using the domain quanata.com. Anything that does not match those domains should be ignored and considered a security risk. About Us Quanata is on a mission to help ensure a better world through context-based ...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-data-engineer-2016761",
    "salary": "$213,000 to $300,000",
    "job_type": "Full-time",
    "posted_date": "2025-06-06T20:50:29",
    "source": "remotive_api",
    "external_id": "2016761",
    "fetched_at": "2025-06-10T09:00:20.938740"
  },
  {
    "title": "Senior Full Stack Engineer, Inbound Email Product Portal",
    "company": "Abnormal",
    "location": "USA",
    "description": "About the Role Abnormal Security is seeking an experienced Full Stack Software Engineer to oversee key areas of the Inbound Email Portal team for Messaging Security Products. The MSP IEPP team is responsible for managing Abnormal's primary Inbound Email Security full stack products, which include various Portal products and features such as Threat Log UI, Dashboard, and Security Analyst Platform systems. The team's objective is to improve Abnormal's detection engine by ensuring product stability...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-full-stack-engineer-inbound-email-product-portal-2016868",
    "salary": "$176,000 - $207,050 usd",
    "job_type": "Full-time",
    "posted_date": "2025-06-06T20:50:28",
    "source": "remotive_api",
    "external_id": "2016868",
    "fetched_at": "2025-06-10T09:00:20.938744"
  },
  {
    "title": "Creative Developer",
    "company": "webAI",
    "location": "USA",
    "description": "About Us: webAI is pioneering the future of artificial intelligence by establishing the first distributed AI infrastructure dedicated to personalized AI. We recognize the evolving demands of a data-driven society for scalability and flexibility, and we firmly believe that the future of AI lies in distributed processing at the edge, bringing computation closer to the source of data generation. Our mission is to build a future where a company's valuable data and intellectual property remain entire...",
    "url": "https://remotive.com/remote-jobs/software-dev/creative-developer-2016781",
    "salary": "competitive salary and performance-based incentives.",
    "job_type": "Full-time",
    "posted_date": "2025-06-06T14:51:01",
    "source": "remotive_api",
    "external_id": "2016781",
    "fetched_at": "2025-06-10T09:00:20.938749"
  },
  {
    "title": "Staff Machine Learning Engineer",
    "company": "Affirm",
    "location": "USA",
    "description": "Affirm is reinventing credit to make it more honest and friendly, giving consumers the flexibility to buy now and pay later without any hidden fees or compounding interest.The Portfolio ML team manages and optimizes the flow of loan opportunities across Affirm-owned and operated properties. We build models, tools, and libraries to support portfolio management actions that balance unit economics, product growth, and user experience. We power ROA-based decisioning; real-time and offline conversion...",
    "url": "https://remotive.com/remote-jobs/software-dev/staff-machine-learning-engineer-2015374",
    "salary": "$225,000 - $275,000 (ca, wa, ny, nj, ct); $200,000 - $250,000 (other us states)",
    "job_type": "Full-time",
    "posted_date": "2025-06-06T04:50:24",
    "source": "remotive_api",
    "external_id": "2015374",
    "fetched_at": "2025-06-10T09:00:20.938753"
  },
  {
    "title": "Senior Data/ML Engineer, Product",
    "company": "Zora",
    "location": "Europe, USA",
    "description": "About Us Zora is a new kind of onchain social network to express yourself freely, connect with others, and discover the value of your imagination. We believe that by using crypto, we can enable a more equitable system for creators, fundamentally rediscovering the power of the internet. We’re working tirelessly to make Zora available to as many people as possible with a simple, fun, and rewarding consumer app. Our mission is to make creating on the internet free and valuable. Who we're looking fo...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-data-ml-engineer-product-2015376",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-06-05T20:50:36",
    "source": "remotive_api",
    "external_id": "2015376",
    "fetched_at": "2025-06-10T09:00:20.938762"
  },
  {
    "title": "Senior Software Engineer in Test",
    "company": "Natera",
    "location": "USA",
    "description": "POSITION SUMMARY: Senior Software Engineer in Test is responsible for developing and maintaining software automation test frameworks and tools using programming languages and test automation libraries. PRIMARY RESPONSIBILITIES: Responsible for supporting test infrastructure of Natera software systems and components. Design, build, and maintain test automation tools and frameworks using clean coding practices and functional programming methodologies. Perform complete end-to-end validation of Nate...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-software-engineer-in-test-2016247",
    "salary": "$123,400 - $154,200 usd",
    "job_type": "Full-time",
    "posted_date": "2025-06-05T20:50:34",
    "source": "remotive_api",
    "external_id": "2016247",
    "fetched_at": "2025-06-10T09:00:20.938766"
  },
  {
    "title": "Machine Learning Engineer",
    "company": "Branch International",
    "location": "India",
    "description": "Branch Overview Branch delivers world-class financial services to the mobile generation. With offices in the United States, Nigeria, Kenya, and India, Branch is a for-profit socially conscious company that uses the power of data science to reduce the cost of delivering financial services in emerging markets. We believe that everyone everywhere deserves fair financial access. The rapid spread of smartphones presents an opportunity for the world’s emerging middle class to access banking options an...",
    "url": "https://remotive.com/remote-jobs/software-dev/machine-learning-engineer-2016308",
    "salary": "competitive salary and equity package",
    "job_type": "Full-time",
    "posted_date": "2025-06-05T20:50:34",
    "source": "remotive_api",
    "external_id": "2016308",
    "fetched_at": "2025-06-10T09:00:20.938770"
  },
  {
    "title": "Senior AIML Engineer",
    "company": "3Pillar Global",
    "location": "India",
    "description": "We build breakthrough software products that power digital businesses. We are an innovative product development partner whose solutions drive rapid revenue, market share, and customer growth for industry leaders in Software and SaaS, Media and Publishing, Information Services, and Retail. Our key differentiator is our Product Mindset. Our development teams focus on building for outcomes and all of our team members around the globe are trained on the Product Mindset’s core values – Minimize Time ...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-aiml-engineer-2016309",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-06-05T16:50:58",
    "source": "remotive_api",
    "external_id": "2016309",
    "fetched_at": "2025-06-10T09:00:20.938774"
  },
  {
    "title": "Senior Shopify Developer",
    "company": "Proxify",
    "location": "CET +/- 3 HOURS",
    "description": "The Role: We are looking for a Senior Shopify Developer for one of our clients. You are a perfect candidate if you are growth-oriented, you love what you do, and you enjoy working on new ideas to develop exciting products and growth features. What we are looking for: Broad shop construction, launch, and maintenance expertise, as well as a general understanding of the admin system. Proven skills in HTML5, CSS3, and JavaScript, as well as a thorough grasp of the DOM. Previous experience working wi...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-shopify-developer-1383531",
    "salary": "$50k-$80K",
    "job_type": "Full-time",
    "posted_date": "2025-06-05T15:31:03",
    "source": "remotive_api",
    "external_id": "1383531",
    "fetched_at": "2025-06-10T09:00:20.938778"
  },
  {
    "title": "Software Engineering Manager",
    "company": "Opendoor",
    "location": "USA, Canada, India",
    "description": "About the Role We’re looking for an Engineering Manager to lead and grow a world-class Growth Engineering team. This is a highly visible and impactful leadership role where you’ll help shape and execute on our growth strategy through technical excellence, experimentation, and deep customer understanding. You will support, mentor, and grow a team of talented engineers while building scalable systems that drive growth and engagement across Opendoor’s platform. Your leadership will set the standard...",
    "url": "https://remotive.com/remote-jobs/software-dev/software-engineering-manager-2015461",
    "salary": "$186,400-$233,000 annually, plus rsus and bonuses",
    "job_type": "Full-time",
    "posted_date": "2025-06-05T12:50:43",
    "source": "remotive_api",
    "external_id": "2015461",
    "fetched_at": "2025-06-10T09:00:20.938782"
  },
  {
    "title": "Senior Software Engineer, Data Acquisition",
    "company": "People Data Labs",
    "location": "USA",
    "description": "Note for all engineering roles: with the rise of fake applicants and AI-enabled candidate fraud, we have built in additional measures throughout the process to identify such candidates and remove them. About Us People Data Labs (PDL) is the provider of people and company data. We do the heavy lifting of data collection and standardization so our customers can focus on building and scaling innovative, compliant data solutions. Our sole focus is on building the best data available by integrating t...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-software-engineer-data-acquisition-2015464",
    "salary": "$160k - $200k",
    "job_type": "Full-time",
    "posted_date": "2025-06-05T02:50:22",
    "source": "remotive_api",
    "external_id": "2015464",
    "fetched_at": "2025-06-10T09:00:20.938787"
  },
  {
    "title": "Mid Software Engineer",
    "company": "Tech9",
    "location": "India",
    "description": "If you are an excellent software engineer who is looking to take the next step in their career, this role is perfect for you! We are looking for a Mid Software Engineer who has expertise in Ruby on Rails (ROR) and React.js to join our team! Benefits: Full health insurance for you and your immediate family 100% remote work (Candidate can opt to work 100% remote, hybrid, or in-person at our Pune office) Flexible Work Timings Excellent Work-Life Balance Competitive Salary Individual compensation de...",
    "url": "https://remotive.com/remote-jobs/software-dev/mid-software-engineer-2015571",
    "salary": "competitive salary based on experience",
    "job_type": "Full-time",
    "posted_date": "2025-06-04T18:51:05",
    "source": "remotive_api",
    "external_id": "2015571",
    "fetched_at": "2025-06-10T09:00:20.938791"
  },
  {
    "title": "Junior Data Engineer",
    "company": "tires-easy.com",
    "location": "Argentina",
    "description": "Junior Data Engineer A bit about us: We’re on a mission to change the tire industry — how it’s delivered and how it’s experienced. A pioneer in the automotive e-commerce industry, we take pride in our extensive selection of top-name brands and budget-friendly options, ensuring our customers find the perfect tire to suit their needs. As a part of our growing and dynamic team, you'll contribute to our commitment to exceptional service, innovation, and customer satisfaction. Embrace the opportunity...",
    "url": "https://remotive.com/remote-jobs/software-dev/junior-data-engineer-2015573",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-06-04T18:51:04",
    "source": "remotive_api",
    "external_id": "2015573",
    "fetched_at": "2025-06-10T09:00:20.938796"
  },
  {
    "title": "Application Engineer",
    "company": "ARHS",
    "location": "Netherlands",
    "description": "Company DescriptionArηs is a fully independent group of companies specialized in managing complex IT projects and systems for large organisations, focusing on state-of-the-art software development, business intelligence and infrastructure services.We are composed of 13 entities across 6 countries that are unified by the Arηs Group, with more than 1750 consultants.This corporate structure enables us to respond quickly to market changes and customer requests, and to communicate and make decisions ...",
    "url": "https://remotive.com/remote-jobs/software-dev/application-engineer-2015574",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-06-04T14:50:25",
    "source": "remotive_api",
    "external_id": "2015574",
    "fetched_at": "2025-06-10T09:00:20.938800"
  },
  {
    "title": "Senior Data Engineer",
    "company": "Service Management Group (SMG)",
    "location": "USA",
    "description": "Data EngineerWhy work at SMG?SMG is a leading experience management (XM) provider, serving restaurants, retailers, and other multi-location consumer businesses by changing how brands act on customer + employee insights. With a rich 30-year history, SMG is uniquely pairing an enterprise software platform with professional services to help brands generate new revenue, grow existing revenue, reduce detractors, and drive operational efficiencies. And with our 2024 acquisition of Bulbshare, we also h...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-data-engineer-2015575",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-06-04T10:50:42",
    "source": "remotive_api",
    "external_id": "2015575",
    "fetched_at": "2025-06-10T09:00:20.938804"
  },
  {
    "title": "C# /.NET Developer",
    "company": "Nitka",
    "location": "Worldwide",
    "description": "Nitka Technologies develops software for customers in the US and Europe and brings together professionals from Eastern Europe, North and South America, Armenia, Georgia and Kazakhstan.. We are looking for an experienced C# /.NET Developer for a long-term project. The customer is an international investment company that creates and implements new solutions to bring maximum profit to its investors. The company helps its clients implement a variety of investment strategies across sectors, asset cla...",
    "url": "https://remotive.com/remote-jobs/software-dev/c-net-developer-2015737",
    "salary": "attractive usd compensation",
    "job_type": "Full-time",
    "posted_date": "2025-06-04T02:50:16",
    "source": "remotive_api",
    "external_id": "2015737",
    "fetched_at": "2025-06-10T09:00:20.938808"
  },
  {
    "title": "Fullstack Engineer",
    "company": "Afresh",
    "location": "USA, Canada",
    "description": "Afresh is on a mission to eliminate food waste and make fresh food accessible to all. Our first A.I.-powered solution optimizes ordering, forecasting, and store operations for fresh food departments in brick-and-mortar grocers. With our Fresh Operating System, regional and national grocery retailers have placed $1.6 billion in produce orders across the US and we've helped our partners prevent 34 million pounds of food from going to waste. Working at Afresh represents a one-of-a-kind opportunity ...",
    "url": "https://remotive.com/remote-jobs/software-dev/fullstack-engineer-2015740",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-06-03T16:50:47",
    "source": "remotive_api",
    "external_id": "2015740",
    "fetched_at": "2025-06-10T09:00:20.938813"
  },
  {
    "title": "AI Engineer",
    "company": "Abnormal",
    "location": "USA",
    "description": "About the Role Abnormal Security is implementing AI Transformation Pods—focused teams led by AI-Native PMs that identify opportunities and build AI solutions to drive meaningful operational change within our organization. These pods operate with high visibility, presenting their work directly to the CEO and functional executives. AI Engineers design, build, and deploy AI-powered solutions that transform internal operations at Abnormal Security. Working in small, focused pods, these engineers app...",
    "url": "https://remotive.com/remote-jobs/software-dev/ai-engineer-2016059",
    "salary": "$148,800 - $175,000 usd",
    "job_type": "Full-time",
    "posted_date": "2025-06-03T06:50:06",
    "source": "remotive_api",
    "external_id": "2016059",
    "fetched_at": "2025-06-10T09:00:20.938817"
  },
  {
    "title": "Senior Application Engineer",
    "company": "Mozilla",
    "location": "Canada",
    "description": "To learn the Hiring Ranges for this position, please select your location from the Apply Now dropdown menu. To learn more about our Hiring Range System, please click this link. Why Mozilla? Mozilla Corporation is the non-profit-backed technology company that has shaped the internet for the better over the last 25 years. We make pioneering brands like Firefox, the privacy-minded web browser, and Pocket, a service for keeping up with the best content online. Now, with more than 225 million people ...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-application-engineer-2015305",
    "salary": "$104,000 - $139,000 cad",
    "job_type": "Full-time",
    "posted_date": "2025-06-03T00:50:52",
    "source": "remotive_api",
    "external_id": "2015305",
    "fetched_at": "2025-06-10T09:00:20.938821"
  },
  {
    "title": "Director of Data Science",
    "company": "Machinify",
    "location": "USA",
    "description": "Machinify is the leading provider of AI-powered software products that transform healthcare claims and payment operations. Each year, the healthcare industry generates over $200B in claims mispayments, creating incredible waste, friction and frustration for all participants: patients, providers, and especially payers. Machinify’s revolutionary AI-platform has enabled the company to develop and deploy, at light speed, industry-specific products that increase the speed and accuracy of claims proce...",
    "url": "https://remotive.com/remote-jobs/software-dev/director-of-data-science-2016060",
    "salary": "competitive salary and equity",
    "job_type": "Full-time",
    "posted_date": "2025-06-03T00:50:52",
    "source": "remotive_api",
    "external_id": "2016060",
    "fetched_at": "2025-06-10T09:00:20.938825"
  },
  {
    "title": "Software Engineer II",
    "company": "Omada Health",
    "location": "USA",
    "description": "Omada Health is on a mission to inspire and engage people in lifelong health, one step at a time. Job overview: Omada Health is a digital care provider that empowers people to achieve their health goals through sustainable behavioral change. We are on a mission to inspire and engage people in lifelong health, one step at a time. We are looking for a software engineer to help drive us forward in achieving that goal. Great software is the key to providing effective care at scale. We hire passionat...",
    "url": "https://remotive.com/remote-jobs/software-dev/software-engineer-ii-2014543",
    "salary": "$147,200 - $184,000 base salary plus bonuses",
    "job_type": "Full-time",
    "posted_date": "2025-06-03T00:50:51",
    "source": "remotive_api",
    "external_id": "2014543",
    "fetched_at": "2025-06-10T09:00:20.938829"
  },
  {
    "title": "Senior Node.js Developer",
    "company": "Eyeo",
    "location": "Germany",
    "description": "Get to know us At eyeo, we transform the internet into a trusted, sustainable and accessible place where users regain control over their experience, content creators and publishers are rewarded for their content, and advertisers and consumers can connect on mutually agreed terms. eyeo’s market-leading ad-filtering technology powers products like Adblock Plus and AdBlock as well as technical integrations for popular browsers. Our solutions empower users to control their online experience and priv...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-node-js-developer-2014621",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-06-02T16:50:34",
    "source": "remotive_api",
    "external_id": "2014621",
    "fetched_at": "2025-06-10T09:00:20.938833"
  },
  {
    "title": "Director of Engineering, Product Platform",
    "company": "Vanta",
    "location": "USA",
    "description": "At Vanta, our mission is to secure the internet and protect consumer data. We believe that security should be monitored and verified continuously, and we empower companies to practice better security and prove it with ease. Vanta has a kind and talented team, and while some have prior security experience, many have been successful at Vanta without it. As a Director of Engineering, you will lead and grow a dynamic engineering organization focused on evolving and scaling our Product &amp; Growth p...",
    "url": "https://remotive.com/remote-jobs/software-dev/director-of-engineering-product-platform-2014743",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-06-02T16:50:32",
    "source": "remotive_api",
    "external_id": "2014743",
    "fetched_at": "2025-06-10T09:00:20.938838"
  },
  {
    "title": "Head of Applied AI",
    "company": "Snorkel AI",
    "location": "USA",
    "description": "We’re on a mission to democratize AI by building the definitive AI data development platform. The AI landscape has gone through incredible change between 2016, when Snorkel started as a research project in the Stanford AI Lab, to the generative AI breakthroughs of today. But one thing has remained constant: the data you use to build AI is the key to achieving differentiation, high performance, and production-ready systems. We work with some of the world’s largest organizations to empower scienti...",
    "url": "https://remotive.com/remote-jobs/software-dev/head-of-applied-ai-2014813",
    "salary": "$220k - $300k ote, includes equity",
    "job_type": "Full-time",
    "posted_date": "2025-06-02T06:50:59",
    "source": "remotive_api",
    "external_id": "2014813",
    "fetched_at": "2025-06-10T09:00:20.938842"
  },
  {
    "title": "Mobile App Developer",
    "company": "Popl",
    "location": "USA",
    "description": "Who We AreThe mission of Popl is simple: We connect companies with their future customers. Popl is defining a new space called “In-Person Marketing”. Professionals and teams use our dashboard and mobile app to capture leads, share digital business cards, and enrich contacts. If you love in-person human connection, come join our mission!About the RoleWe are looking for an experienced mobile app engineer to join our growing mobile app team. Our mobile app is currently used by millions of professio...",
    "url": "https://remotive.com/remote-jobs/software-dev/mobile-app-developer-2014893",
    "salary": "competitive salary with meaningful equity",
    "job_type": "Full-time",
    "posted_date": "2025-06-02T04:50:29",
    "source": "remotive_api",
    "external_id": "2014893",
    "fetched_at": "2025-06-10T09:00:20.938847"
  },
  {
    "title": "Senior Data Engineer | Gen AI",
    "company": "Wellhub",
    "location": "Brazil",
    "description": "Your wellbeing matters. Join a company that cares. GET TO KNOW US Wellhub (formerly Gympass*) is a corporate wellness platform that connects employees to the best partners for fitness, mindfulness, therapy, nutrition, and sleep, all included in one subscription designed to cost less than each individual partner. Founded in 2012 and headquartered in NYC, we have a growing global team in 11 countries. At Wellhub, you have the opportunity to build a career in a high-growth tech company that places ...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-data-engineer-gen-ai-2014894",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-06-01T22:50:48",
    "source": "remotive_api",
    "external_id": "2014894",
    "fetched_at": "2025-06-10T09:00:20.938851"
  },
  {
    "title": "Principal Engineer",
    "company": "Velotio Technologies",
    "location": "India",
    "description": "Velotio Technologies is a product engineering company working with innovative startups and enterprises. We are a certified Great Place to Work® and recognized as one of the best companies to work for in India. We have provided full-stack product development for 325+ startups across the globe building products in the cloud-native, data engineering, B2B SaaS, IoT &amp; Machine Learning space. Our team of 400+ elite software engineers solves hard technical problems while transforming customer ideas...",
    "url": "https://remotive.com/remote-jobs/software-dev/principal-engineer-2014899",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-06-01T22:50:47",
    "source": "remotive_api",
    "external_id": "2014899",
    "fetched_at": "2025-06-10T09:00:20.938855"
  },
  {
    "title": "Software Solutions Architect",
    "company": "AssistRx",
    "location": "USA",
    "description": "Description Communicate with clients, account managers, product owners, and analysts to understand business requirements Ability to translate business requirements into technical diagrams, designs, guides, and implementations Understanding of basic SDLC and experience working under agile project management styles Ability to document technical designs and data exchange standards in a way that can be handed off to internal and external development teams Communicate with development teams to guide ...",
    "url": "https://remotive.com/remote-jobs/software-dev/software-solutions-architect-2014900",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-06-01T22:50:46",
    "source": "remotive_api",
    "external_id": "2014900",
    "fetched_at": "2025-06-10T09:00:20.938859"
  },
  {
    "title": "Senior Software Engineer",
    "company": "Known",
    "location": "USA",
    "description": "WE HAVE CREATED A WORLD WHERE ART AND SCIENCE ARE BEST FRIENDS Known is a modern marketing company engineered for the unprecedented opportunities and challenges facing marketers today. We are about 200+ people strong, pairing PhD data scientists with award-winning creatives, strategists, engineers and expert research teams to produce some of the most innovative and cutting-edge creative work in culture. We believe that when creative truly collaborates with science, strategy, and technology, amaz...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-software-engineer-2015000",
    "salary": "$135k-$165k",
    "job_type": "Full-time",
    "posted_date": "2025-06-01T14:50:48",
    "source": "remotive_api",
    "external_id": "2015000",
    "fetched_at": "2025-06-10T09:00:20.938863"
  },
  {
    "title": "Software Engineer III, Observability",
    "company": "Waveapps",
    "location": "Canada",
    "description": "At Wave, we help small businesses to thrive so the heart of our communities beats stronger. We work in an environment buzzing with creative energy and inspiration. No matter where you are or how you get the job done, you have what you need to be successful and connected. The mark of true success at Wave is the ability to be bold, learn quickly and share your knowledge generously.Software Engineers on the Observability team collaborate closely with platform and product engineering teams to enhanc...",
    "url": "https://remotive.com/remote-jobs/software-dev/software-engineer-iii-observability-2015001",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-06-01T04:51:15",
    "source": "remotive_api",
    "external_id": "2015001",
    "fetched_at": "2025-06-10T09:00:20.938868"
  },
  {
    "title": "Kotlin Engineer",
    "company": "VirtusLab",
    "location": "Poland",
    "description": "We are #VLteam – tech enthusiasts constantly striving for growth. The team is our foundation, that’s why we care the most about the friendly atmosphere, a lot of self-development opportunities and good working conditions. Trust and autonomy are two essential qualities that drive our performance. We simply believe in the idea of ​​“measuring outcomes, not hours”. Join us &amp; see for yourself!Kotlin Engineer (Senior)You will be supporting the one of the well known CI/CD tool on the market. Your ...",
    "url": "https://remotive.com/remote-jobs/software-dev/kotlin-engineer-2015003",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-06-01T04:51:14",
    "source": "remotive_api",
    "external_id": "2015003",
    "fetched_at": "2025-06-10T09:00:20.938872"
  },
  {
    "title": "Software Engineering Intern",
    "company": "Ada",
    "location": "Canada",
    "description": "About Us Ada is an AI customer service company whose mission is to make customer service extraordinary for everyone. We're driven to raise a new standard of quality customer service at scale, enabling enterprise companies to deliver experiences that people love–instant, proactive, personalized, and effortless. Ada is an AI transformation platform and partner—combining strategic expertise with powerful AI agent management technology to accelerate businesses’ AI maturity to keep them ahead of the ...",
    "url": "https://remotive.com/remote-jobs/software-dev/software-engineering-intern-2015189",
    "salary": "",
    "job_type": "Internship",
    "posted_date": "2025-06-01T04:51:13",
    "source": "remotive_api",
    "external_id": "2015189",
    "fetched_at": "2025-06-10T09:00:20.938876"
  },
  {
    "title": "Software Engineer",
    "company": "Headspace",
    "location": "USA",
    "description": "About the Software Engineer, Full Stack at Headspace: Headspace is seeking a talented Software Engineer, Full Stack to join its B2B Team. The B2B team builds and maintains our eligibility and enrollment systems for enterprise and SME customers, as well as integrations with strategic partners. This role is on the Employer Platform team, focused on designing and building the next-generation enterprise platform. You’ll be central to our growth as we scale partnerships and internal capabilities. We ...",
    "url": "https://remotive.com/remote-jobs/software-dev/software-engineer-2015191",
    "salary": "$100,800-$161,000 + equity + benefits",
    "job_type": "Full-time",
    "posted_date": "2025-06-01T02:50:54",
    "source": "remotive_api",
    "external_id": "2015191",
    "fetched_at": "2025-06-10T09:00:20.938881"
  },
  {
    "title": "Data Scientist",
    "company": "klick",
    "location": "Canada",
    "description": "The Team The Klick Consulting Data Science team supports our clients on multiple fronts, including: commercial and marketing analytics and optimization; healthcare utilization and clinical outcomes analysis; novel AI/ML applications in digital health; creating and maintaining data products and repositories. To learn more about the team, visit https://consulting.klick.com Job Details Employment type: freelance Hours per week: ad hoc Job Description The ideal candidate will have some research expe...",
    "url": "https://remotive.com/remote-jobs/software-dev/data-scientist-2014181",
    "salary": "",
    "job_type": "Freelance",
    "posted_date": "2025-05-31T22:50:21",
    "source": "remotive_api",
    "external_id": "2014181",
    "fetched_at": "2025-06-10T09:00:20.938885"
  },
  {
    "title": "Data Scientist",
    "company": "Oversee",
    "location": "Poland",
    "description": "Oversee is revolutionizing how business travel is managed. Our cutting-edge technology and solutions are the latest in price assurance, advanced travel analytics, and reporting capabilities, providing a comprehensive view of corporate travel spend. We excel in helping our customers optimize their travel programs, cut costs, and improve the experience for their business travelers. If you are looking for a dynamic and positive work environment and want to be at the core of solving a global $17B pr...",
    "url": "https://remotive.com/remote-jobs/software-dev/data-scientist-2013885",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-31T22:50:21",
    "source": "remotive_api",
    "external_id": "2013885",
    "fetched_at": "2025-06-10T09:00:20.938890"
  },
  {
    "title": "Senior Software Engineer",
    "company": "The Zebra",
    "location": "USA",
    "description": "Introduction:The Zebra is revolutionizing how consumers research and shop for insurance. We intentionally strive to build diverse teams that feel inclusive for all. Our motto is \"All Stripes Welcome,\" and we put that into practice by valuing both traditional and non-conventional backgrounds and perspectives. Our Zeebs are passionate about learning, growing, &amp; working together to tackle exciting problems.We're seeking a Senior Full Stack Software Engineer with strong frontend experience to jo...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-software-engineer-2012727",
    "salary": "$141,000-168,000 per year",
    "job_type": "Full-time",
    "posted_date": "2025-05-31T04:50:50",
    "source": "remotive_api",
    "external_id": "2012727",
    "fetched_at": "2025-06-10T09:00:20.938894"
  },
  {
    "title": "Junior JS/Python developer",
    "company": "TechBiz Global GmbH",
    "location": "Germany",
    "description": "At TechBiz Global, we are providing recruitment service to our TOP clients from our portfolio. We are currently seeking a Junior JS/Python developer to join one of our clients' teams in Berlin. This part-time role is ideal for individuals passionate about ESG initiatives and eager to contribute to building tools that make a difference.Key Responsibilities:Collaborate with the development team to design and implement web-based applications using JavaScript and Python.Assist in developing and main...",
    "url": "https://remotive.com/remote-jobs/software-dev/junior-js-python-developer-2012726",
    "salary": "",
    "job_type": "Part-time",
    "posted_date": "2025-05-31T04:50:50",
    "source": "remotive_api",
    "external_id": "2012726",
    "fetched_at": "2025-06-10T09:00:20.938898"
  },
  {
    "title": "Solutions Architect",
    "company": "Snowflake",
    "location": "USA",
    "description": "Build the future of the AI Data Cloud. Join the Snowflake team.We are looking for a Solutions Architect, Public Sector to be part of our Professional Services team to deploy cloud products and services for our customers. This person must be a hands-on, self-starter who loves solving innovative problems in a fast-paced, agile environment. The ideal candidate will have the insight to connect a specific business problem and Snowflake’s solution and communicate that connection and vision to various ...",
    "url": "https://remotive.com/remote-jobs/software-dev/solutions-architect-2012729",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-31T04:50:49",
    "source": "remotive_api",
    "external_id": "2012729",
    "fetched_at": "2025-06-10T09:00:20.938902"
  },
  {
    "title": "Sr Machine Learning Engineer - Fintech Foundation",
    "company": "Hopper",
    "location": "USA",
    "description": "About the jobHopper is continually redefining how people travel, combining a best-in-class travel agency with a portfolio of proprietary fintech offerings that give our customers peace of mind when booking travel. More than 100M monthly active users are exposed to our products through our mobile app and a growing list of partners such as CapitalOne, Air Canada, and Spirit Airlines. With a real-time feed of 50B+ priced itineraries daily along with more than ten years of history and multiple exter...",
    "url": "https://remotive.com/remote-jobs/software-dev/sr-machine-learning-engineer-fintech-foundation-2012790",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-31T00:50:39",
    "source": "remotive_api",
    "external_id": "2012790",
    "fetched_at": "2025-06-10T09:00:20.938907"
  },
  {
    "title": "(Senior) ML Engineer / Software Engineer Machine Learning & AI",
    "company": "Scalable",
    "location": "Germany",
    "description": "Company DescriptionScalable Capital is a leading digital investment platform in Europe. The company empowers everyone to shape their financial future. Scalable Broker makes it easy and affordable for clients to invest professionally in stocks, ETFs and other exchange-traded products and set up savings plans. Scalable Wealth, the digital wealth management service, offers clients professional investment in ETF portfolios and is also adopted as a white-label solution by renowned B2B partners. With ...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-ml-engineer-software-engineer-machine-learning-ai-2012791",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-30T20:50:21",
    "source": "remotive_api",
    "external_id": "2012791",
    "fetched_at": "2025-06-10T09:00:20.938911"
  },
  {
    "title": "Research Engineer",
    "company": "Helm AI",
    "location": "USA",
    "description": "We help make autonomous technologies more efficient, safer, and accessible. Helm.ai builds AI software for autonomous driving and robotics. Our Deep Teaching™ methodology is uniquely data and capital efficient, allowing us to surpass traditional approaches. Our unsupervised learning software can train neural networks without the need for human annotation or simulation and is hardware-agnostic. We work with some of the world's largest automotive manufacturers and we've raised over $100M from Hond...",
    "url": "https://remotive.com/remote-jobs/software-dev/research-engineer-2012794",
    "salary": "$150,000 to $250,000",
    "job_type": "Full-time",
    "posted_date": "2025-05-30T20:50:21",
    "source": "remotive_api",
    "external_id": "2012794",
    "fetched_at": "2025-06-10T09:00:20.938918"
  },
  {
    "title": "Full Stack Engineer",
    "company": "Vonage",
    "location": "Poland",
    "description": "Join Vonage and help us innovate cloud communications for businesses worldwide! Why this role matters Our team is the driving force behind multiple communication solutions across various platforms within Vonage. This year, we’re introducing several new communication channels—an exciting step forward in our mission to deliver a comprehensive and unified contact center. Our environment supports hundreds of thousands of daily users, both internally and externally. As part of our vibrant community, ...",
    "url": "https://remotive.com/remote-jobs/software-dev/full-stack-engineer-2012872",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-30T20:50:20",
    "source": "remotive_api",
    "external_id": "2012872",
    "fetched_at": "2025-06-10T09:00:20.938922"
  },
  {
    "title": "Ruby-on-Rails Engineer (Turbo/Stimulus/Hotwire)",
    "company": "EverAI",
    "location": "Worldwide",
    "description": "Our VisionAt EverAI, we specialize in creating conversational AI experiences for roleplay, gaming, social interactions, and creative writing. Dive into a world where every chat is an adventure.Our ProductSince our public release in September 2023, we have experienced incredible traction growing from 0 to 26M users. As we grow, our goal is to keep enhancing existing key features as well as developing new exciting functionalities (group chat, AI chat &amp; phone calls in local languages, video cal...",
    "url": "https://remotive.com/remote-jobs/software-dev/ruby-on-rails-engineer-turbo-stimulus-hotwire-2015256",
    "salary": "$80K - $120K",
    "job_type": "Full-time",
    "posted_date": "2025-05-30T20:30:49",
    "source": "remotive_api",
    "external_id": "2015256",
    "fetched_at": "2025-06-10T09:00:20.938927"
  },
  {
    "title": "Senior Software Engineer, Flutter",
    "company": "SoFi",
    "location": "USA",
    "description": "Employee Applicant Privacy Notice Who we are: Shape a brighter financial future with us. Together with our members, we’re changing the way people think about and interact with personal finance. We’re a next-generation financial services company and national bank using innovative, mobile-first technology to help our millions of members reach their goals. The industry is going through an unprecedented transformation, and we’re at the forefront. We’re proud to come to work every day knowing that wh...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-software-engineer-flutter-2012875",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-30T02:50:46",
    "source": "remotive_api",
    "external_id": "2012875",
    "fetched_at": "2025-06-10T09:00:20.938932"
  },
  {
    "title": "Ruby Software Engineer",
    "company": "Black White Zebra",
    "location": "Brazil",
    "description": "About us:We’re the indie media company helping millions of people succeed at work. And we're on a roll, growing faster than any company you'll have worked at before. For the past five years we've benefited from consistent triple digit growth.We make content - from in-depth guides, to training courses, to members forums that help people succeed at work. We support organizations through better led, better equipped teams that benefit from smarter buying decisions.We've built a portfolio of influent...",
    "url": "https://remotive.com/remote-jobs/software-dev/ruby-software-engineer-2012876",
    "salary": "hourly rate, seniority and experience based",
    "job_type": "Contract",
    "posted_date": "2025-05-30T02:50:45",
    "source": "remotive_api",
    "external_id": "2012876",
    "fetched_at": "2025-06-10T09:00:20.938936"
  },
  {
    "title": "Senior Application Security Engineer",
    "company": "Practical DevSecOps",
    "location": "India",
    "description": "Job Type: Permanent(Full Time/Full-Time)Function: Application Security EngineerLocation: RemoteExperience Required: 5-6 years Position Overview We are seeking an Application Security Engineer to join our team and help maintain, enhance, and develop security training exercises for our renowned DevSecOps, API Security, Threat Modeling and many other courses. The ideal candidate will bring technical security expertise while having the ability to create educational content that aligns with our pract...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-application-security-engineer-2013768",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-30T02:50:43",
    "source": "remotive_api",
    "external_id": "2013768",
    "fetched_at": "2025-06-10T09:00:20.938945"
  },
  {
    "title": "Lead Data Engineer",
    "company": "5x Data",
    "location": "India",
    "description": "At 5X our top priority is now to build out the platform. Picture every company using 5X as getting a core stack (Data Ingestion, Warehouse, Modelling &amp; Orchestration and BI) out of the box with user permissions and Utilization insights. We are looking for Data Engineers with with a proven track record of successfully delivering end-to-end data solutions. This is a full time role. Responsibilities Lead the analysis of client's business requirements to deliver strategic data solutions that ali...",
    "url": "https://remotive.com/remote-jobs/software-dev/lead-data-engineer-2013769",
    "salary": "competitive compensation and meaningful equity",
    "job_type": "Full-time",
    "posted_date": "2025-05-30T02:50:42",
    "source": "remotive_api",
    "external_id": "2013769",
    "fetched_at": "2025-06-10T09:00:20.938949"
  },
  {
    "title": "Software Developer",
    "company": "Smart Working Solutions",
    "location": "India",
    "description": "About Smart WorkingAt Smart Working, we believe your job should feel right — not just look right on paper. This isn’t just another remote role. This is belonging remotely — and that’s a big difference. From day one, you're supported, valued, and part of a genuine community. We're proud to be one of the highest-rated companies on Glassdoor India.With one vision in mind — “Geographical limitations should not dictate access to talent” — Smart Working helps great people build long-term, full-time re...",
    "url": "https://remotive.com/remote-jobs/software-dev/software-developer-2013770",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-29T20:50:56",
    "source": "remotive_api",
    "external_id": "2013770",
    "fetched_at": "2025-06-10T09:00:20.938953"
  },
  {
    "title": "Splunk Professional Services Engineer",
    "company": "Ascera",
    "location": "Northern America",
    "description": "Own The Role:SP6 is seeking a full-time consultant to join our professional services team in North America. This position involves helping customers with the architecture and hands-on administration/engineering of Splunk. Helping Fortune 2000 customers get the most out of their platform. Ideally, this individual will have a Security background focusing on helping customers with Splunk Enterprise Security.Consultants get to work on many use cases, across different industries, working with Splunk ...",
    "url": "https://remotive.com/remote-jobs/software-dev/splunk-professional-services-engineer-2013771",
    "salary": "competitive salary and ote",
    "job_type": "Full-time",
    "posted_date": "2025-05-29T18:50:24",
    "source": "remotive_api",
    "external_id": "2013771",
    "fetched_at": "2025-06-10T09:00:20.938958"
  },
  {
    "title": "AI Implementation Engineer",
    "company": "GROUPON",
    "location": "Portugal",
    "description": "Groupon is a marketplace where customers discover new experiences and services everyday and local businesses thrive. To date we have worked with over a million merchant partners worldwide, connecting over 16 million customers with deals across various categories. In a world often dominated by e-commerce giants, we stand out as one of the few platforms uniquely committed to helping local businesses succeed on a performance basis. Groupon is on a radical journey to transform our business with rele...",
    "url": "https://remotive.com/remote-jobs/software-dev/ai-implementation-engineer-2013822",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-29T18:50:21",
    "source": "remotive_api",
    "external_id": "2013822",
    "fetched_at": "2025-06-10T09:00:20.938962"
  },
  {
    "title": "Founding Full-Stack Engineer - AI",
    "company": "Getwingapp",
    "location": "China",
    "description": "About The CompanyOur client is a company building the go-to AI copilot for educators, universities, and international schools, supported by Antler and Nvidia - currently post-MVP, early stage, and revenue-generating. If you love working on real AI projects, shipping fast, scaling, and sweating the details, please apply.The RoleAs the founding engineer, you'll help define the architecture, ship critical features, and set the technical bar. You’ll have end-to-end ownership and work closely with th...",
    "url": "https://remotive.com/remote-jobs/software-dev/founding-full-stack-engineer-ai-2014011",
    "salary": "equity-first compensation, salary added post-funding",
    "job_type": "Full-time",
    "posted_date": "2025-05-29T18:50:20",
    "source": "remotive_api",
    "external_id": "2014011",
    "fetched_at": "2025-06-10T09:00:20.938966"
  },
  {
    "title": "Senior Frontend Software Engineer",
    "company": "WithClutch",
    "location": "Brazil",
    "description": "About the RoleAs a Senior Frontend Software Engineer on the DAO team, you will design, build, and maintain scalable systems that deliver a first-class experience for both Credit Union members and staff, ultimately driving the growth in newly opened accounts.This role offers a unique opportunity to work closely with our Product and Design teams, as well as collaborate with external partners, giving you the chance to strengthen skills beyond engineering, such as communication, product thinking, an...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-frontend-software-engineer-2014012",
    "salary": "",
    "job_type": "Contract",
    "posted_date": "2025-05-28T22:50:19",
    "source": "remotive_api",
    "external_id": "2014012",
    "fetched_at": "2025-06-10T09:00:20.938971"
  },
  {
    "title": "Data Engineer",
    "company": "Arroyo Consulting",
    "location": "Colombia",
    "description": "We are looking for a Data Engineer to join our growing data team. The ideal candidate will have strong experience in designing and implementing scalable data pipelines, working with cloud platforms, and collaborating across teams to ensure the reliability, efficiency, and quality of data systems. Tasks Design, build, and maintain robust ETL/ELT data pipelines across various sources (APIs, databases, cloud storage). Develop and optimize data orchestration workflows using tools like Apache Airflow...",
    "url": "https://remotive.com/remote-jobs/software-dev/data-engineer-2014017",
    "salary": "tailored based on candidate's expectations",
    "job_type": "Contract",
    "posted_date": "2025-05-28T22:50:18",
    "source": "remotive_api",
    "external_id": "2014017",
    "fetched_at": "2025-06-10T09:00:20.938975"
  },
  {
    "title": "Junior AI Automation Associate",
    "company": "HeadQuarters",
    "location": "Worldwide",
    "description": "Are you passionate about technology and problem-solving? Do you love playing strategy games like Civilization, Age of Empires, or Starcraft, where planning, puzzles, and logic come together to form complex strategies? Do you want to dive into the world of AI, learning how to leverage powerful tools like ChatGPT to create automation and streamline processes for a fast-growing company in the cannabis industry? At Headquarters, we are looking for enthusiastic, curious, and driven individuals who ar...",
    "url": "https://remotive.com/remote-jobs/software-dev/junior-ai-automation-associate-2014074",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-28T22:50:18",
    "source": "remotive_api",
    "external_id": "2014074",
    "fetched_at": "2025-06-10T09:00:20.938980"
  },
  {
    "title": "Founding Lead AI Engineer",
    "company": "Launchyfi",
    "location": "Worldwide",
    "description": "Who We Are We’re two commercial and operational co-founders with a proven track record in growing and scaling companies—including a $43M trade sale. Between us, we’ve led M&amp;A deals, built high-performing teams, and launched multiple startups. After collaborating closely for the past six months, we’ve decided to build something much bigger together. Now, we're assembling a world-class founding team to bring our vision to life. We're building the next billion-dollar lean startup, and we’re loo...",
    "url": "https://remotive.com/remote-jobs/software-dev/founding-lead-ai-engineer-2014226",
    "salary": "competitive salary post-funding, equity up to 10%",
    "job_type": "Full-time",
    "posted_date": "2025-05-28T16:50:14",
    "source": "remotive_api",
    "external_id": "2014226",
    "fetched_at": "2025-06-10T09:00:20.938984"
  },
  {
    "title": "Senior Software Engineer",
    "company": "League, Inc.",
    "location": "Canada",
    "description": "About League Founded in 2014, and with a total funding currently at $220 million; League is a platform technology company powering next-generation healthcare consumer experiences. Payers, providers, consumer health partners and employers build on League’s platform to deliver high-engagement, personalized healthcare experiences consumers love. Millions of people use solutions powered by League to access, navigate and pay for care. Position Summary As Senior Software Engineer, Backend, you are res...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-software-engineer-2012878",
    "salary": "$113,500 - $170,300 cad",
    "job_type": "Full-time",
    "posted_date": "2025-05-28T16:50:13",
    "source": "remotive_api",
    "external_id": "2012878",
    "fetched_at": "2025-06-10T09:00:20.938988"
  },
  {
    "title": "Junior Software Engineer - Full Stack",
    "company": "Ekumenlabs",
    "location": "Germany, Spain",
    "description": "#poweringyouringenuity 🚀Our mission is to bridge top-level technology companies with engineering talent from across the globe. With presence in LATAM, USA and Europe, we empower companies by providing remote engineering teams of all levels tailored to the needs of each project.Our teams are passionate about technology and thrive on challenges. We value technical expertise and a willingness to learn new things. Each development is tailored to the needs of each project, so being passionate about l...",
    "url": "https://remotive.com/remote-jobs/software-dev/junior-software-engineer-full-stack-2012880",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-28T16:50:12",
    "source": "remotive_api",
    "external_id": "2012880",
    "fetched_at": "2025-06-10T09:00:20.938993"
  },
  {
    "title": "Senior Ruby on Rails Developer",
    "company": "Proxify",
    "location": "CET +/- 3 HOURS",
    "description": "The Role: We are looking for a Senior Ruby on Rails developer for one of our clients. You are a perfect candidate if you are growth-oriented, you love what you do, and you enjoy working on new ideas to develop exciting products and growth features. What we are looking for: 5+ years of Ruby on Rails development experience. Strong in Ruby, Rails, and RESTful APIs. Proficient in database design and SQL. Experience with testing (e.g., RSpec) and Git. Solid understanding of HTML, CSS, and JavaScript....",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-ruby-on-rails-developer-1606658",
    "salary": "$40k - $75k",
    "job_type": "Full-time",
    "posted_date": "2025-05-28T15:56:12",
    "source": "remotive_api",
    "external_id": "1606658",
    "fetched_at": "2025-06-10T09:00:20.938997"
  },
  {
    "title": "Middle Android Developer",
    "company": "Genesis",
    "location": "Ukraine",
    "description": "At Promova, we're redefining language education to make it accessible, personal, and effective for today's fast-paced world. Our growing team of 150+ professionals is on a mission to connect people, bridge cultures, and empower lifelong learners—reaching every country except aggressor states (yes, even Antarctica). We blend AI-driven innovation with human expertise to create tools that help people speak with confidence, embrace new cultures, and truly belong in any language. As part of our team,...",
    "url": "https://remotive.com/remote-jobs/software-dev/middle-android-developer-2012976",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-27T14:51:03",
    "source": "remotive_api",
    "external_id": "2012976",
    "fetched_at": "2025-06-10T09:00:20.939002"
  },
  {
    "title": "Data Scientist - Optimization and Modeling",
    "company": "Blend360",
    "location": "USA",
    "description": "Company Description Blend is a premier AI services provider, committed to co-creating meaningful impact for its clients through the power of data science, AI, technology, and people. With a mission to fuel bold visions, Blend tackles significant challenges by seamlessly aligning human expertise with artificial intelligence. The company is dedicated to unlocking value and fostering innovation for its clients by harnessing world-class people and data-driven strategy. We believe that the power of p...",
    "url": "https://remotive.com/remote-jobs/software-dev/data-scientist-optimization-and-modeling-2013435",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-27T14:51:01",
    "source": "remotive_api",
    "external_id": "2013435",
    "fetched_at": "2025-06-10T09:00:20.939006"
  },
  {
    "title": "Staff Software Engineer",
    "company": "Aledade",
    "location": "USA",
    "description": "As a Staff Software Engineer, you will take us beyond traditional monolithic SQL engines and batch pipelines. You will build the next generation of distributed data storage and processing systems. You will build systems that can scale indefinitely, and surpass traditional query performance, while making the interfaces for that data simple, expressive, and cleanly abstracted. Your interfaces will support a broad array of data consumers, from our web application, to business analytics, and artific...",
    "url": "https://remotive.com/remote-jobs/software-dev/staff-software-engineer-2013236",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-27T14:50:59",
    "source": "remotive_api",
    "external_id": "2013236",
    "fetched_at": "2025-06-10T09:00:20.939010"
  },
  {
    "title": "AI Founding Engineer",
    "company": "Netboxlabs",
    "location": "USA",
    "description": "At NetBox Labs, we’re building the future of network automation. Our products power the network source of truth for thousands of organizations, from fast-growing startups to global enterprises. We’re now looking for a hands-on, technically experienced AI/ML engineer to help us bring intelligent, context-aware capabilities to our product suite — and establish the foundation for our AI function.About the Role:This is a founding role on a new AI initiative at NetBox Labs. You’ll be exploring and de...",
    "url": "https://remotive.com/remote-jobs/software-dev/ai-founding-engineer-2013300",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-27T14:50:58",
    "source": "remotive_api",
    "external_id": "2013300",
    "fetched_at": "2025-06-10T09:00:20.939013"
  },
  {
    "title": "Software Engineer",
    "company": "MinIO",
    "location": "USA",
    "description": "MinIO is the leader in high-performance, hyper-scale object storage. The company’s commercial offering, AIStor, is built for the exascale data infrastructure challenges presented by modern AI workloads. Designed for mission-critical, production workloads, MinIO is deployed by 77% of the F100 and powers many of the largest private cloud AI deployments in the world. MinIO is looking for a Software Engineer. As a Software Engineer, Customer Infrastructure, you will work closely with customers as we...",
    "url": "https://remotive.com/remote-jobs/software-dev/software-engineer-2013237",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-27T14:50:58",
    "source": "remotive_api",
    "external_id": "2013237",
    "fetched_at": "2025-06-10T09:00:20.939018"
  },
  {
    "title": "Senior Backend Engineer",
    "company": "ChargerHelp",
    "location": "USA",
    "description": "About UsChargerHelp! Inc. is a California-based tech company on a mission to power up the EV ecosystem. We're not just solving a challenge; we're driving the charge towards a sustainable future. Our EMPWR platform provides Reliability as a Service (RaaS), delivering data-driven insights that keep electric vehicle charging stations operating smoothly.We're a dynamic, mission-driven startup that believes in innovation, integrity, and an unwavering commitment to quality. If you join us, you'll be p...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-backend-engineer-2013374",
    "salary": "$160,000 - $180,000 usd/year",
    "job_type": "Full-time",
    "posted_date": "2025-05-26T14:50:14",
    "source": "remotive_api",
    "external_id": "2013374",
    "fetched_at": "2025-06-10T09:00:20.939022"
  },
  {
    "title": "Senior PHP Developer",
    "company": "Oxylabs",
    "location": "Poland",
    "description": "We’re a team of 500+ professionals who develop cutting-edge proxy and web data scraping solutions for thousands of the world’s best known businesses, including Fortune 500 companies. What’s in store for you:You’ll be developing complex products with high coding standards, maintaining our own infrastructure, handling petabytes of data, and solving challenges on a daily basis. We got you covered with a team of strong professionals to support you, a well-built tech stack, and loads of ownership.The...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-php-developer-2013375",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-26T14:50:14",
    "source": "remotive_api",
    "external_id": "2013375",
    "fetched_at": "2025-06-10T09:00:20.939026"
  },
  {
    "title": "Senior Software Engineer",
    "company": "Jump",
    "location": "USA",
    "description": "DescriptionJump is the only end-to-end fan experience platform built for sports teams and venues, breaking the mold for what fans can expect at live events.Our enterprise software enables sports teams and venues to unlock the massive opportunities that come from real relationships with their fans, rethinking the traditional model that hasn’t put the fan experience first.Jump was founded in 2021 by Marc Lore, Alex Rodriguez, and Jordy Leiser and backed by top venture firms including Forerunner Ve...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-software-engineer-2013376",
    "salary": "$185,000 plus equity",
    "job_type": "Full-time",
    "posted_date": "2025-05-26T14:50:13",
    "source": "remotive_api",
    "external_id": "2013376",
    "fetched_at": "2025-06-10T09:00:20.939030"
  },
  {
    "title": "Data Infrastructure Engineer",
    "company": "Worth AI",
    "location": "USA",
    "description": "Worth AI, a leader in the computer software industry, is looking for a talented and experienced Data Infrastructure Engineer to join their innovative team. At Worth AI, we are on a mission to revolutionize decision-making with the power of artificial intelligence while fostering an environment of collaboration, and adaptability, aiming to make a meaningful impact in the tech landscape.. Our team values include extreme ownership, one team and creating reaving fans both for our employees and custo...",
    "url": "https://remotive.com/remote-jobs/software-dev/data-infrastructure-engineer-2013378",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-26T14:50:12",
    "source": "remotive_api",
    "external_id": "2013378",
    "fetched_at": "2025-06-10T09:00:20.939323"
  },
  {
    "title": "Staff Software Engineer",
    "company": "SoFi",
    "location": "USA, Canada",
    "description": "Employee Applicant Privacy Notice Who we are: Shape a brighter financial future with us. Together with our members, we’re changing the way people think about and interact with personal finance. We’re a next-generation financial services company and national bank using innovative, mobile-first technology to help our millions of members reach their goals. The industry is going through an unprecedented transformation, and we’re at the forefront. We’re proud to come to work every day knowing that wh...",
    "url": "https://remotive.com/remote-jobs/software-dev/staff-software-engineer-2013379",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-26T14:50:12",
    "source": "remotive_api",
    "external_id": "2013379",
    "fetched_at": "2025-06-10T09:00:20.939332"
  },
  {
    "title": "Freelance Principal Data Engineer",
    "company": "Seamless.AI",
    "location": "Mexico",
    "description": "The Opportunity: At Seamless.AI, we’re seeking a highly skilled and experienced Freelance Principal Data Engineer with expertise in Python, Spark, AWS Glue, and other ETL (Extract, Transform, Load) technologies. The ideal candidate will have a proven track record in data acquisition and transformation, as well as experience working with large data sets and applying methodologies for data matching and aggregation methodologies. This independent contractor role requires exceptional organizational ...",
    "url": "https://remotive.com/remote-jobs/software-dev/freelance-principal-data-engineer-2013380",
    "salary": "compensation based on project milestones",
    "job_type": "Contract",
    "posted_date": "2025-05-26T14:50:11",
    "source": "remotive_api",
    "external_id": "2013380",
    "fetched_at": "2025-06-10T09:00:20.939337"
  },
  {
    "title": "Solutions Architect Lead",
    "company": "Upstage",
    "location": "Japan",
    "description": "Upstage focuses on solving business problems using AI technology. With the mission of “Building intelligence for the future of work,” the company goes beyond simple task automation to develop AI solutions that enhance productivity through complex decision-making support. Through this, Upstage aims to revolutionize workflows and help businesses grow more efficiently. We are dedicated to delivering “easy-to-apply AI solutions” so that everyone can benefit from AI technology. It has launched a seri...",
    "url": "https://remotive.com/remote-jobs/software-dev/solutions-architect-lead-2013602",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-26T14:50:09",
    "source": "remotive_api",
    "external_id": "2013602",
    "fetched_at": "2025-06-10T09:00:20.939342"
  },
  {
    "title": "Senior Director of Engineering",
    "company": "Array",
    "location": "USA",
    "description": "Array is a financial innovation platform that helps digital brands, financial institutions, and fintechs get compelling consumer products to market faster. We deliver a suite of credit and identity monitoring tools, privacy protection, and a financial ads marketplace via embeddable widgets or a clean, modern API. Our private label offerings help drive revenue and increase engagement for our customers while empowering millions of consumers to achieve their financial goals. As a remote-first compa...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-director-of-engineering-2012375",
    "salary": "$275,000+ base salary",
    "job_type": "Full-time",
    "posted_date": "2025-05-25T02:50:38",
    "source": "remotive_api",
    "external_id": "2012375",
    "fetched_at": "2025-06-10T09:00:20.939347"
  },
  {
    "title": "Software Engineer, Customer Infrastructure",
    "company": "MinIO",
    "location": "Europe",
    "description": "MinIO is the leader in high-performance, hyper-scale object storage. The company’s commercial offering, AIStor, is built for the exascale data infrastructure challenges presented by modern AI workloads. Designed for mission-critical, production workloads, MinIO is deployed by 77% of the F100 and powers many of the largest private cloud AI deployments in the world. MinIO is looking for a Software Engineer. As a Software Engineer, Customer Infrastructure, you will work closely with customers as we...",
    "url": "https://remotive.com/remote-jobs/software-dev/software-engineer-customer-infrastructure-2012378",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-25T00:50:53",
    "source": "remotive_api",
    "external_id": "2012378",
    "fetched_at": "2025-06-10T09:00:20.939351"
  },
  {
    "title": "Principal Fullstack Engineer, Applied AI",
    "company": "Aleph",
    "location": "LATAM, USA, Canada",
    "description": "About AlephAleph is an AI-native platform for Financial Planning &amp; Analysis (FP&amp;A). We operate in an established software category with a multi-billion market but no clear winner. Our growth has come from product velocity and customer outcomes, not marketing spend, and the results speak for themselves.Aleph was founded by Albert Gozzi and Santiago Perez De Rosso, two technical founders with backgrounds from Stanford and MIT and experience working at top-tier companies such as Google, Mic...",
    "url": "https://remotive.com/remote-jobs/software-dev/principal-fullstack-engineer-applied-ai-2012381",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-24T18:50:21",
    "source": "remotive_api",
    "external_id": "2012381",
    "fetched_at": "2025-06-10T09:00:20.939355"
  },
  {
    "title": "Senior Software Engineer",
    "company": "Five9",
    "location": "Australia",
    "description": "Join us in bringing joy to customer experience. Five9 is a leading provider of cloud contact center software, bringing the power of cloud innovation to customers worldwide. Living our values everyday results in our team-first culture and enables us to innovate, grow, and thrive while enjoying the journey together. We celebrate diversity and foster an inclusive environment, empowering our employees to be their authentic selves. The team The product engineering team drive the realization of practi...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-software-engineer-2012382",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-24T02:50:46",
    "source": "remotive_api",
    "external_id": "2012382",
    "fetched_at": "2025-06-10T09:00:20.939395"
  },
  {
    "title": "SAP Technology Consultant",
    "company": "Sapfioneer",
    "location": "Germany",
    "description": "About SAP Fioneer:Innovation is and will always be the core to SAP Fioneer, and it is the promise of why we were spun out of SAP: agility, innovation, and delivery.SAP Fioneer builds on a heritage of outstanding technology and a deep understanding of corporate and consumer demands. At the heart of it all it is simple: We bring financial services to the next level with innovative software solutions and platforms.We are helping companies in the financial services industry to achieve speed, scalabi...",
    "url": "https://remotive.com/remote-jobs/software-dev/sap-technology-consultant-2012485",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-24T00:51:06",
    "source": "remotive_api",
    "external_id": "2012485",
    "fetched_at": "2025-06-10T09:00:20.939400"
  },
  {
    "title": "Associate Software Automation Engineering Specialist",
    "company": "MeridianLink",
    "location": "USA",
    "description": "POSITION SUMMARYThe Software Automation Engineer 1 is an entry level member of the Software Automation team who will report to the Software Automation Manager. They are primarily responsible for the setup and maintenance of loan programs used within the Product Pricing Engine (PriceMyLoan). The Software Automation Engineer will be given additional responsibilities and tackle increasingly complex tasks as they progress in the team and obtain technical and mortgage expertise. ESSENTIAL FUNCTIONS A...",
    "url": "https://remotive.com/remote-jobs/software-dev/associate-software-automation-engineering-specialist-2012486",
    "salary": "$55,000 - $75,200",
    "job_type": "Full-time",
    "posted_date": "2025-05-24T00:51:00",
    "source": "remotive_api",
    "external_id": "2012486",
    "fetched_at": "2025-06-10T09:00:20.939404"
  },
  {
    "title": "Strong Middle Backend Engineer",
    "company": "saas.group",
    "location": "Europe",
    "description": "This role is part of our Keyword.com team, one of our growing brands at saas.group. At Keyword.com, we're a small team with a big mission: helping SEO pros track and boost their Google rankings. Our tool cuts through the noise, showing businesses what really matters when it comes to optimizing their digital presence. As part of saas.group, our team is scattered across Europe and looking for innovative minds to join our journey. As we continue to grow, we’re seeking a Backend Engineer to pioneer ...",
    "url": "https://remotive.com/remote-jobs/software-dev/strong-middle-backend-engineer-2012488",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-23T22:50:42",
    "source": "remotive_api",
    "external_id": "2012488",
    "fetched_at": "2025-06-10T09:00:20.939408"
  },
  {
    "title": "Senior Data Engineer",
    "company": "Later",
    "location": "USA",
    "description": "Later is the enterprise leader in social media and influencer marketing software, services, and data, trusted by leading brands and agencies worldwide. Following our acquisition of Mavely, the Everyday Influencer Platform®, Later enables brands to scale creator partnerships from nano to premium influencers while managing social media content and campaigns across all major social and affiliate networks. Through proprietary performance data, marketing leaders can drive attributable sales and optim...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-data-engineer-2012489",
    "salary": "160,000 - 190,000 usd",
    "job_type": "Full-time",
    "posted_date": "2025-05-23T22:50:41",
    "source": "remotive_api",
    "external_id": "2012489",
    "fetched_at": "2025-06-10T09:00:20.939413"
  },
  {
    "title": "Senior Backend Software Engineer",
    "company": "Dynamic",
    "location": "USA",
    "description": "We're seeking a Senior Software EngineerDynamic started with a simple vision: every app and website will have a wallet. Three years in, that vision is no longer just an idea. It’s happening now. Wallets are no longer just for crypto apps. They’re becoming the backbone of fintech, payroll, and global remittances. They power faster, cheaper, and more accessible transactions. The best crypto apps, like Ondo Finance, Story, and Magic Eden already run on Dynamic. Now, the world’s top fintech and HR p...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-backend-software-engineer-2012490",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-23T22:50:41",
    "source": "remotive_api",
    "external_id": "2012490",
    "fetched_at": "2025-06-10T09:00:20.939417"
  },
  {
    "title": "Senior Research Engineer",
    "company": "Output",
    "location": "USA",
    "description": "Love music? Come sit with us. At our core, we help creative people make better music with cutting edge technology.We are Output - the secret sauce behind much of the music you know. A global leader in music creation software, powering the world's biggest hitmakers. We are best known for our groundbreaking creative plugins and instruments like Arcade, Co-Producer, Exhale, Rev, and Portal—used to create hits by artists like Beyoncé, Kendrick Lamar, Billie Eilish, Skrillex, and Björk, as well as sc...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-research-engineer-2011721",
    "salary": "$155,000 - $195,000",
    "job_type": "Full-time",
    "posted_date": "2025-05-23T02:50:33",
    "source": "remotive_api",
    "external_id": "2011721",
    "fetched_at": "2025-06-10T09:00:20.939421"
  },
  {
    "title": "Senior Software Engineer",
    "company": "DockYard",
    "location": "Europe, USA, South America",
    "description": "DockYard is hiring an experienced Senior Svelte Developer who is passionate about web technologies and has experience designing robust frontend architectures using Svelte. Who We Are DockYard is a remote-first digital product consultancy. Forward-thinking teams come to us to build digital products that scale as their users, features, and complexity grow. Using a candid approach to partnerships, we help to upskill teams along the way. The result? More flexibility in how our clients take products ...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-software-engineer-2011812",
    "salary": "",
    "job_type": "Contract",
    "posted_date": "2025-05-23T00:50:23",
    "source": "remotive_api",
    "external_id": "2011812",
    "fetched_at": "2025-06-10T09:00:20.939426"
  },
  {
    "title": "Software Engineer",
    "company": "Zencore",
    "location": "LATAM",
    "description": "Zencore is a fast-growing company founded by former Google Cloud leaders, architects, and engineers. We are seeking candidates with significant experience in Google Cloud to join our team. Our engagements aim to eliminate obstacles, reduce risk, and accelerate timelines for customers transitioning to Google and seeking assistance with data and application modernization. We embed within customer teams to provide strategic guidance, facilitate technology decisions, and execute projects in a collab...",
    "url": "https://remotive.com/remote-jobs/software-dev/software-engineer-2011915",
    "salary": "",
    "job_type": "Contract",
    "posted_date": "2025-05-22T20:50:37",
    "source": "remotive_api",
    "external_id": "2011915",
    "fetched_at": "2025-06-10T09:00:20.939486"
  },
  {
    "title": "Martech Engineer",
    "company": "Prizepicks",
    "location": "USA",
    "description": "At PrizePicks, we are the fastest-growing sports company in North America, as recognized by Inc. 5000. As the leading platform for Daily Fantasy Sports, we cover a diverse range of sports leagues, including the NFL, NBA, and Esports titles like League of Legends and Counter-Strike. Our team of over 450 employees thrives in an inclusive culture that values individuals from diverse backgrounds, regardless of their level of sports fandom. Ready to reimagine the DFS industry together? Overview We’re...",
    "url": "https://remotive.com/remote-jobs/software-dev/martech-engineer-2011917",
    "salary": "$130,000 to $200,000",
    "job_type": "Full-time",
    "posted_date": "2025-05-22T20:50:36",
    "source": "remotive_api",
    "external_id": "2011917",
    "fetched_at": "2025-06-10T09:00:20.939495"
  },
  {
    "title": "Senior Full-Stack Engineer",
    "company": "Software Intelligence Works",
    "location": "Northern America, Americas, USA, Canada, USA timezones",
    "description": "Senior Full-Stack Engineer: Build the Missing Tool for Data ConnectorsWho We AreWe're creating what Cursor is to coding and Replit is to development environments, but for SaaS data connectors. We're small, US-based, profitable, and building something people actually need instead of chasing investor buzzwords.The RoleWe need a Senior Full-Stack Engineer who can own projects completely and ship quality code that works. This is a full-time, remote position available now for someone who wants to bui...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-full-stack-engineer-2011648",
    "salary": "$75 - $90K",
    "job_type": "Full-time",
    "posted_date": "2025-05-22T12:06:46",
    "source": "remotive_api",
    "external_id": "2011648",
    "fetched_at": "2025-06-10T09:00:20.939499"
  },
  {
    "title": "Applied Sr Data Scientist - Fintech Foundation",
    "company": "Hopper",
    "location": "Spain",
    "description": "About the job Hopper is continually redefining how people travel, combining a best-in-class travel agency with a portfolio of proprietary fintech offerings that give our customers peace of mind when booking travel. More than 100M monthly active users are exposed to our products through our mobile app and a growing list of partners such as CapitalOne, Air Canada, and Spirit Airlines. With a real-time feed of 50B+ priced itineraries daily along with more than ten years of history and multiple exte...",
    "url": "https://remotive.com/remote-jobs/software-dev/applied-sr-data-scientist-fintech-foundation-2011005",
    "salary": "competitive salary with pre-ipo equity",
    "job_type": "Full-time",
    "posted_date": "2025-05-22T02:50:27",
    "source": "remotive_api",
    "external_id": "2011005",
    "fetched_at": "2025-06-10T09:00:20.939504"
  },
  {
    "title": "Odoo Developer",
    "company": "YouNav",
    "location": "Europe",
    "description": "Remote policy: Fully remote Remote location: Europe Company: YouNav Salary: 65-75k EUR (gross employer cost) Type of Employment: Full-time (CET hours) Long term Contractor (or Full-time employee in France only) About YouNav YouNav is the most advanced Marina Management System (MMS) on the market, managing 10,000+ berths and boaters, with 100+ marina staff users. Our software boosts boater satisfaction, streamlines marina operations, and frees up staff from repetitive tasks (younav.com). We’ve sp...",
    "url": "https://remotive.com/remote-jobs/software-dev/odoo-developer-1971901",
    "salary": "€65k - €75k",
    "job_type": "Full-time",
    "posted_date": "2025-05-20T07:14:08",
    "source": "remotive_api",
    "external_id": "1971901",
    "fetched_at": "2025-06-10T09:00:20.939650"
  },
  {
    "title": "Data Science Expert",
    "company": "IspeedToLead",
    "location": "Worldwide",
    "description": "Now we’re looking for a Data Science Expert who’s not just great with numbers, but hungry to build real things - models, insights, and features - that go live and make a measurable difference. What You’ll Be Doing: Own the design and development of machine learning models, forecasting systems, and lead scoring algorithms Turn messy, high-volume data into clear business signals and predictive insights Work cross-functionally with product, engineering, and growth to embed models into the product a...",
    "url": "https://remotive.com/remote-jobs/software-dev/data-science-expert-2011185",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-20T03:55:52",
    "source": "remotive_api",
    "external_id": "2011185",
    "fetched_at": "2025-06-10T09:00:20.939673"
  },
  {
    "title": "Senior Microsoft PowerBI Developer",
    "company": "Proxify",
    "location": "CET +/- 3 HOURS",
    "description": "The Role: We are looking for a Senior Microsoft Power BI developer for one of our clients. You are a perfect candidate if you are growth-oriented, you love what you do, and you enjoy working on new ideas to develop exciting products and growth features. What we are looking for: Background with BI tools and systems such as Power BI, Tableau, and SAP Prior experience in data-related tasks Understanding of the Microsoft BI Stack Mastery in data analytics Proficiency in software development Familiar...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-microsoft-powerbi-developer-1359476",
    "salary": "$50k-$80k",
    "job_type": "Contract",
    "posted_date": "2025-05-18T07:31:08",
    "source": "remotive_api",
    "external_id": "1359476",
    "fetched_at": "2025-06-10T09:00:20.939678"
  },
  {
    "title": "Senior Independent Software Developer",
    "company": "A.Team",
    "location": "Americas, Europe, Israel",
    "description": "You must be located in the Americas, Europe, or Israel to apply.A·Team is a VC-backed, stealth, application-only home on the internet for senior independent software builders to team up with hand-picked, high-growth companies on their next big thing. After talking with hundreds of independent engineers, designers, and product folks, we heard over and over that finding vetted, high-quality, consistent clients is hard, and projects are often too small to be rewarding. A·Team matches small teams of...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-independent-software-developer-1919265",
    "salary": "$90 - $150 /hour",
    "job_type": "Contract",
    "posted_date": "2025-05-16T10:16:00",
    "source": "remotive_api",
    "external_id": "1919265",
    "fetched_at": "2025-06-10T09:00:20.939682"
  },
  {
    "title": "Web Designer",
    "company": "Contra",
    "location": "Worldwide",
    "description": "We’re seeking a freelance web designer/developer to lead a website rebuild. This project involves creating a clean-slate, product-led Webflow site that communicates our value and drives conversions. What You’ll Do Design a modern brand look based on our logo, color palette, and product UI. Build a responsive Webflow homepage with modular sections for product details and value propositions. Create key subpages (Pricing, Blog, Legal, Contact) with CMS integration for easy updates. Implement basic ...",
    "url": "https://remotive.com/remote-jobs/software-dev/web-designer-2009129",
    "salary": "$4k - $8k total",
    "job_type": "Freelance",
    "posted_date": "2025-05-14T23:09:04",
    "source": "remotive_api",
    "external_id": "2009129",
    "fetched_at": "2025-06-10T09:00:20.939687"
  },
  {
    "title": "Senior Magento Developer",
    "company": "Proxify",
    "location": "CET +/- 3 HOURS",
    "description": "The Role: We are looking for a Senior Magento II Developer for one of our clients. You are a perfect candidate if you are growth-oriented, you love what you do, and you enjoy working on new ideas to develop exciting products and growth features. What we are looking for: 5+ years of extensive experience with Magento II, JavaScript, HTML, PHP, CSS, and MySQL Expert understanding of Magento's code structure, extension architecture, theming hierarchy, and fallback components. Competency in authoring...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-magento-developer-1591692",
    "salary": "$45k - $80k",
    "job_type": "Full-time",
    "posted_date": "2025-05-14T16:31:06",
    "source": "remotive_api",
    "external_id": "1591692",
    "fetched_at": "2025-06-10T09:00:20.939691"
  },
  {
    "title": "Senior Backend Developer (Node.js)",
    "company": "Tether",
    "location": "Worldwide",
    "description": "Join Tether and Shape the Future of Digital FinanceAt Tether, we’re not just building products, we’re pioneering a global financial revolution. Our cutting-edge solutions empower businesses—from exchanges and wallets to payment processors and ATMs—to seamlessly integrate reserve-backed tokens across blockchains. By harnessing the power of blockchain technology, Tether enables you to store, send, and receive digital tokens instantly, securely, and globally, all at a fraction of the cost. Transpar...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-backend-developer-node-js-1984510",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-13T12:46:44",
    "source": "remotive_api",
    "external_id": "1984510",
    "fetched_at": "2025-06-10T09:00:20.939695"
  }
]