[
  {
    "title": "Senior PHP Developer",
    "company": "Oxylabs",
    "location": "Poland",
    "description": "We’re a team of 500+ professionals who develop cutting-edge proxy and web data scraping solutions for thousands of the world’s best known businesses, including Fortune 500 companies. What’s in store for you:You’ll be developing complex products with high coding standards, maintaining our own infrastructure, handling petabytes of data, and solving challenges on a daily basis. We got you covered with a team of strong professionals to support you, a well-built tech stack, and loads of ownership.The...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-php-developer-2013375",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-26T14:50:14",
    "source": "remotive_api",
    "external_id": "2013375",
    "fetched_at": "2025-05-28T00:01:11.781754"
  },
  {
    "title": "Senior Backend Engineer",
    "company": "ChargerHelp",
    "location": "USA",
    "description": "About UsChargerHelp! Inc. is a California-based tech company on a mission to power up the EV ecosystem. We're not just solving a challenge; we're driving the charge towards a sustainable future. Our EMPWR platform provides Reliability as a Service (RaaS), delivering data-driven insights that keep electric vehicle charging stations operating smoothly.We're a dynamic, mission-driven startup that believes in innovation, integrity, and an unwavering commitment to quality. If you join us, you'll be p...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-backend-engineer-2013374",
    "salary": "$160,000 - $180,000 usd/year",
    "job_type": "Full-time",
    "posted_date": "2025-05-26T14:50:14",
    "source": "remotive_api",
    "external_id": "2013374",
    "fetched_at": "2025-05-28T00:01:11.781759"
  },
  {
    "title": "Senior Software Engineer",
    "company": "Jump",
    "location": "USA",
    "description": "DescriptionJump is the only end-to-end fan experience platform built for sports teams and venues, breaking the mold for what fans can expect at live events.Our enterprise software enables sports teams and venues to unlock the massive opportunities that come from real relationships with their fans, rethinking the traditional model that hasn’t put the fan experience first.Jump was founded in 2021 by Marc Lore, Alex Rodriguez, and Jordy Leiser and backed by top venture firms including Forerunner Ve...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-software-engineer-2013376",
    "salary": "$185,000 plus equity",
    "job_type": "Full-time",
    "posted_date": "2025-05-26T14:50:13",
    "source": "remotive_api",
    "external_id": "2013376",
    "fetched_at": "2025-05-28T00:01:11.781762"
  },
  {
    "title": "Staff Software Engineer",
    "company": "SoFi",
    "location": "USA, Canada",
    "description": "Employee Applicant Privacy Notice Who we are: Shape a brighter financial future with us. Together with our members, we’re changing the way people think about and interact with personal finance. We’re a next-generation financial services company and national bank using innovative, mobile-first technology to help our millions of members reach their goals. The industry is going through an unprecedented transformation, and we’re at the forefront. We’re proud to come to work every day knowing that wh...",
    "url": "https://remotive.com/remote-jobs/software-dev/staff-software-engineer-2013379",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-26T14:50:12",
    "source": "remotive_api",
    "external_id": "2013379",
    "fetched_at": "2025-05-28T00:01:11.781764"
  },
  {
    "title": "Data Infrastructure Engineer",
    "company": "Worth AI",
    "location": "USA",
    "description": "Worth AI, a leader in the computer software industry, is looking for a talented and experienced Data Infrastructure Engineer to join their innovative team. At Worth AI, we are on a mission to revolutionize decision-making with the power of artificial intelligence while fostering an environment of collaboration, and adaptability, aiming to make a meaningful impact in the tech landscape.. Our team values include extreme ownership, one team and creating reaving fans both for our employees and custo...",
    "url": "https://remotive.com/remote-jobs/software-dev/data-infrastructure-engineer-2013378",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-26T14:50:12",
    "source": "remotive_api",
    "external_id": "2013378",
    "fetched_at": "2025-05-28T00:01:11.781767"
  },
  {
    "title": "Freelance Principal Data Engineer",
    "company": "Seamless.AI",
    "location": "Mexico",
    "description": "The Opportunity: At Seamless.AI, we’re seeking a highly skilled and experienced Freelance Principal Data Engineer with expertise in Python, Spark, AWS Glue, and other ETL (Extract, Transform, Load) technologies. The ideal candidate will have a proven track record in data acquisition and transformation, as well as experience working with large data sets and applying methodologies for data matching and aggregation methodologies. This independent contractor role requires exceptional organizational ...",
    "url": "https://remotive.com/remote-jobs/software-dev/freelance-principal-data-engineer-2013380",
    "salary": "compensation based on project milestones",
    "job_type": "Contract",
    "posted_date": "2025-05-26T14:50:11",
    "source": "remotive_api",
    "external_id": "2013380",
    "fetched_at": "2025-05-28T00:01:11.781769"
  },
  {
    "title": "Senior Salesforce Developer",
    "company": "1840 & Company",
    "location": "Philippines",
    "description": "Job Title: Senior Salesforce Developer (7+ Years Experience) Location: Remote Job Type: Full-Time / Contract Location: Philippines About the Role We are looking for a highly skilled Senior Salesforce Developer with over 7 years of experience to lead the design, development, and optimization of enterprise-level Salesforce solutions. You will work closely with Head of CRM, work on Solutions given by Head of CRM and business stakeholders to implement strategic CRM initiatives, drive automation, and...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-salesforce-developer-2013564",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-26T14:50:10",
    "source": "remotive_api",
    "external_id": "2013564",
    "fetched_at": "2025-05-28T00:01:11.781771"
  },
  {
    "title": "Solutions Architect Lead",
    "company": "Upstage",
    "location": "Japan",
    "description": "Upstage focuses on solving business problems using AI technology. With the mission of “Building intelligence for the future of work,” the company goes beyond simple task automation to develop AI solutions that enhance productivity through complex decision-making support. Through this, Upstage aims to revolutionize workflows and help businesses grow more efficiently. We are dedicated to delivering “easy-to-apply AI solutions” so that everyone can benefit from AI technology. It has launched a seri...",
    "url": "https://remotive.com/remote-jobs/software-dev/solutions-architect-lead-2013602",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-26T14:50:09",
    "source": "remotive_api",
    "external_id": "2013602",
    "fetched_at": "2025-05-28T00:01:11.781773"
  },
  {
    "title": "Senior Director of Engineering",
    "company": "Array",
    "location": "USA",
    "description": "Array is a financial innovation platform that helps digital brands, financial institutions, and fintechs get compelling consumer products to market faster. We deliver a suite of credit and identity monitoring tools, privacy protection, and a financial ads marketplace via embeddable widgets or a clean, modern API. Our private label offerings help drive revenue and increase engagement for our customers while empowering millions of consumers to achieve their financial goals. As a remote-first compa...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-director-of-engineering-2012375",
    "salary": "$275,000+ base salary",
    "job_type": "Full-time",
    "posted_date": "2025-05-25T02:50:38",
    "source": "remotive_api",
    "external_id": "2012375",
    "fetched_at": "2025-05-28T00:01:11.781776"
  },
  {
    "title": "Software Engineer, Customer Infrastructure",
    "company": "MinIO",
    "location": "Europe",
    "description": "MinIO is the leader in high-performance, hyper-scale object storage. The company’s commercial offering, AIStor, is built for the exascale data infrastructure challenges presented by modern AI workloads. Designed for mission-critical, production workloads, MinIO is deployed by 77% of the F100 and powers many of the largest private cloud AI deployments in the world. MinIO is looking for a Software Engineer. As a Software Engineer, Customer Infrastructure, you will work closely with customers as we...",
    "url": "https://remotive.com/remote-jobs/software-dev/software-engineer-customer-infrastructure-2012378",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-25T00:50:53",
    "source": "remotive_api",
    "external_id": "2012378",
    "fetched_at": "2025-05-28T00:01:11.781777"
  },
  {
    "title": "Data Engineer/BI Engineer",
    "company": "canibuild",
    "location": "Worldwide",
    "description": "About Us Canibuild automates the residential construction industry’s design, approval, and sales processes, allowing clients to answer 'Can I build this on this plot of land?' instantly. As a fast-growing SaaS platform backed by Australia’s largest hedge fund, we serve clients across Australia, New Zealand, Canada, and the US. Role Overview We are seeking a highly skilled Data Engineer / BI Engineer with experience in designing ETL/ELT pipelines, managing databases, and developing dashboards usi...",
    "url": "https://remotive.com/remote-jobs/software-dev/data-engineer-bi-engineer-2012380",
    "salary": "competitive salary, benefits, and opportunities for growth",
    "job_type": "Full-time",
    "posted_date": "2025-05-25T00:50:52",
    "source": "remotive_api",
    "external_id": "2012380",
    "fetched_at": "2025-05-28T00:01:11.781779"
  },
  {
    "title": "Team Lead - Node.js",
    "company": "Sprious",
    "location": "Europe",
    "description": "🌍 About UsWe're a company with a startup soul operating in the proxy and web scraping industry for 9+ years. We move fast, we experiment, and we're not afraid to change course when something's not working. Pivoting isn't a failure for us — it's how we grow and learn.Collaboration and adaptability are part of our everyday rhythm. If high-traffic back-end systems, performance tuning, and leading talented engineers light you up, you’ll feel right at home here.🚀 Who We’re Looking ForA Team Lead who ...",
    "url": "https://remotive.com/remote-jobs/software-dev/team-lead-node-js-2012379",
    "salary": "",
    "job_type": "Contract",
    "posted_date": "2025-05-25T00:50:52",
    "source": "remotive_api",
    "external_id": "2012379",
    "fetched_at": "2025-05-28T00:01:11.781782"
  },
  {
    "title": "Principal Fullstack Engineer, Applied AI",
    "company": "Aleph",
    "location": "LATAM, USA, Canada",
    "description": "About AlephAleph is an AI-native platform for Financial Planning &amp; Analysis (FP&amp;A). We operate in an established software category with a multi-billion market but no clear winner. Our growth has come from product velocity and customer outcomes, not marketing spend, and the results speak for themselves.Aleph was founded by Albert Gozzi and Santiago Perez De Rosso, two technical founders with backgrounds from Stanford and MIT and experience working at top-tier companies such as Google, Mic...",
    "url": "https://remotive.com/remote-jobs/software-dev/principal-fullstack-engineer-applied-ai-2012381",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-24T18:50:21",
    "source": "remotive_api",
    "external_id": "2012381",
    "fetched_at": "2025-05-28T00:01:11.781784"
  },
  {
    "title": "Senior Software Engineer",
    "company": "Five9",
    "location": "Australia",
    "description": "Join us in bringing joy to customer experience. Five9 is a leading provider of cloud contact center software, bringing the power of cloud innovation to customers worldwide. Living our values everyday results in our team-first culture and enables us to innovate, grow, and thrive while enjoying the journey together. We celebrate diversity and foster an inclusive environment, empowering our employees to be their authentic selves. The team The product engineering team drive the realization of practi...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-software-engineer-2012382",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-24T02:50:46",
    "source": "remotive_api",
    "external_id": "2012382",
    "fetched_at": "2025-05-28T00:01:11.781786"
  },
  {
    "title": "SAP Technology Consultant",
    "company": "Sapfioneer",
    "location": "Germany",
    "description": "About SAP Fioneer:Innovation is and will always be the core to SAP Fioneer, and it is the promise of why we were spun out of SAP: agility, innovation, and delivery.SAP Fioneer builds on a heritage of outstanding technology and a deep understanding of corporate and consumer demands. At the heart of it all it is simple: We bring financial services to the next level with innovative software solutions and platforms.We are helping companies in the financial services industry to achieve speed, scalabi...",
    "url": "https://remotive.com/remote-jobs/software-dev/sap-technology-consultant-2012485",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-24T00:51:06",
    "source": "remotive_api",
    "external_id": "2012485",
    "fetched_at": "2025-05-28T00:01:11.781787"
  },
  {
    "title": "Associate Software Automation Engineering Specialist",
    "company": "MeridianLink",
    "location": "USA",
    "description": "POSITION SUMMARYThe Software Automation Engineer 1 is an entry level member of the Software Automation team who will report to the Software Automation Manager. They are primarily responsible for the setup and maintenance of loan programs used within the Product Pricing Engine (PriceMyLoan). The Software Automation Engineer will be given additional responsibilities and tackle increasingly complex tasks as they progress in the team and obtain technical and mortgage expertise. ESSENTIAL FUNCTIONS A...",
    "url": "https://remotive.com/remote-jobs/software-dev/associate-software-automation-engineering-specialist-2012486",
    "salary": "$55,000 - $75,200",
    "job_type": "Full-time",
    "posted_date": "2025-05-24T00:51:00",
    "source": "remotive_api",
    "external_id": "2012486",
    "fetched_at": "2025-05-28T00:01:11.781789"
  },
  {
    "title": "Full Stack Engineer",
    "company": "Smart Working Solutions",
    "location": "India",
    "description": "About Smart WorkingAt Smart Working, we believe your job should feel right — not just look right on paper. This isn’t just another remote role. This is belonging remotely — and that’s a big difference. From day one, you're supported, valued, and part of a genuine community. We're proud to be one of the highest-rated companies on Glassdoor India.With one vision in mind — “Geographical limitations should not dictate access to talent” — Smart Working helps great people build long-term, full-time re...",
    "url": "https://remotive.com/remote-jobs/software-dev/full-stack-engineer-2012487",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-24T00:50:55",
    "source": "remotive_api",
    "external_id": "2012487",
    "fetched_at": "2025-05-28T00:01:11.781791"
  },
  {
    "title": "Strong Middle Backend Engineer",
    "company": "saas.group",
    "location": "Europe",
    "description": "This role is part of our Keyword.com team, one of our growing brands at saas.group. At Keyword.com, we're a small team with a big mission: helping SEO pros track and boost their Google rankings. Our tool cuts through the noise, showing businesses what really matters when it comes to optimizing their digital presence. As part of saas.group, our team is scattered across Europe and looking for innovative minds to join our journey. As we continue to grow, we’re seeking a Backend Engineer to pioneer ...",
    "url": "https://remotive.com/remote-jobs/software-dev/strong-middle-backend-engineer-2012488",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-23T22:50:42",
    "source": "remotive_api",
    "external_id": "2012488",
    "fetched_at": "2025-05-28T00:01:11.781793"
  },
  {
    "title": "Senior Data Engineer",
    "company": "Later",
    "location": "USA",
    "description": "Later is the enterprise leader in social media and influencer marketing software, services, and data, trusted by leading brands and agencies worldwide. Following our acquisition of Mavely, the Everyday Influencer Platform®, Later enables brands to scale creator partnerships from nano to premium influencers while managing social media content and campaigns across all major social and affiliate networks. Through proprietary performance data, marketing leaders can drive attributable sales and optim...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-data-engineer-2012489",
    "salary": "160,000 - 190,000 usd",
    "job_type": "Full-time",
    "posted_date": "2025-05-23T22:50:41",
    "source": "remotive_api",
    "external_id": "2012489",
    "fetched_at": "2025-05-28T00:01:11.781795"
  },
  {
    "title": "Senior Backend Software Engineer",
    "company": "Dynamic",
    "location": "USA",
    "description": "We're seeking a Senior Software EngineerDynamic started with a simple vision: every app and website will have a wallet. Three years in, that vision is no longer just an idea. It’s happening now. Wallets are no longer just for crypto apps. They’re becoming the backbone of fintech, payroll, and global remittances. They power faster, cheaper, and more accessible transactions. The best crypto apps, like Ondo Finance, Story, and Magic Eden already run on Dynamic. Now, the world’s top fintech and HR p...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-backend-software-engineer-2012490",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-23T22:50:41",
    "source": "remotive_api",
    "external_id": "2012490",
    "fetched_at": "2025-05-28T00:01:11.781797"
  },
  {
    "title": "Software Engineer - Data Collection Tools",
    "company": "Mozilla",
    "location": "USA",
    "description": "To learn the Hiring Ranges for this position, please select your location from the Apply Now dropdown menu. To learn more about our Hiring Range System, please click this link. Why Mozilla? Mozilla Corporation is the non-profit-backed technology company that has shaped the internet for the better over the last 25 years. We make pioneering brands like Firefox, the privacy-minded web browser, and Pocket, a service for keeping up with the best content online. Now, with more than 225 million people ...",
    "url": "https://remotive.com/remote-jobs/software-dev/software-engineer-data-collection-tools-2012221",
    "salary": "$163,000 - $217,000 usd",
    "job_type": "Full-time",
    "posted_date": "2025-05-23T18:50:14",
    "source": "remotive_api",
    "external_id": "2012221",
    "fetched_at": "2025-05-28T00:01:11.781799"
  },
  {
    "title": "Senior Research Engineer",
    "company": "Output",
    "location": "USA",
    "description": "Love music? Come sit with us. At our core, we help creative people make better music with cutting edge technology.We are Output - the secret sauce behind much of the music you know. A global leader in music creation software, powering the world's biggest hitmakers. We are best known for our groundbreaking creative plugins and instruments like Arcade, Co-Producer, Exhale, Rev, and Portal—used to create hits by artists like Beyoncé, Kendrick Lamar, Billie Eilish, Skrillex, and Björk, as well as sc...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-research-engineer-2011721",
    "salary": "$155,000 - $195,000",
    "job_type": "Full-time",
    "posted_date": "2025-05-23T02:50:33",
    "source": "remotive_api",
    "external_id": "2011721",
    "fetched_at": "2025-05-28T00:01:11.781801"
  },
  {
    "title": "AI Security Solutions Architect",
    "company": "Palo Alto Networks",
    "location": "USA",
    "description": "Company DescriptionOur MissionAt Palo Alto Networks® everything starts and ends with our mission:Being the cybersecurity partner of choice, protecting our digital way of life. Our vision is a world where each day is safer and more secure than the one before. We are a company built on the foundation of challenging and disrupting the way things are done, and we’re looking for innovators who are as committed to shaping the future of cybersecurity as we are.Who We AreWe take our mission of protectin...",
    "url": "https://remotive.com/remote-jobs/software-dev/ai-security-solutions-architect-2011722",
    "salary": "$222,000 - $304,500 per year",
    "job_type": "Full-time",
    "posted_date": "2025-05-23T00:50:26",
    "source": "remotive_api",
    "external_id": "2011722",
    "fetched_at": "2025-05-28T00:01:11.781803"
  },
  {
    "title": "Senior Software Engineer",
    "company": "DockYard",
    "location": "Europe, USA, South America",
    "description": "DockYard is hiring an experienced Senior Svelte Developer who is passionate about web technologies and has experience designing robust frontend architectures using Svelte. Who We Are DockYard is a remote-first digital product consultancy. Forward-thinking teams come to us to build digital products that scale as their users, features, and complexity grow. Using a candid approach to partnerships, we help to upskill teams along the way. The result? More flexibility in how our clients take products ...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-software-engineer-2011812",
    "salary": "",
    "job_type": "Contract",
    "posted_date": "2025-05-23T00:50:23",
    "source": "remotive_api",
    "external_id": "2011812",
    "fetched_at": "2025-05-28T00:01:11.781805"
  },
  {
    "title": "Software Engineer",
    "company": "Zencore",
    "location": "LATAM",
    "description": "Zencore is a fast-growing company founded by former Google Cloud leaders, architects, and engineers. We are seeking candidates with significant experience in Google Cloud to join our team. Our engagements aim to eliminate obstacles, reduce risk, and accelerate timelines for customers transitioning to Google and seeking assistance with data and application modernization. We embed within customer teams to provide strategic guidance, facilitate technology decisions, and execute projects in a collab...",
    "url": "https://remotive.com/remote-jobs/software-dev/software-engineer-2011915",
    "salary": "",
    "job_type": "Contract",
    "posted_date": "2025-05-22T20:50:37",
    "source": "remotive_api",
    "external_id": "2011915",
    "fetched_at": "2025-05-28T00:01:11.781807"
  },
  {
    "title": "Martech Engineer",
    "company": "Prizepicks",
    "location": "USA",
    "description": "At PrizePicks, we are the fastest-growing sports company in North America, as recognized by Inc. 5000. As the leading platform for Daily Fantasy Sports, we cover a diverse range of sports leagues, including the NFL, NBA, and Esports titles like League of Legends and Counter-Strike. Our team of over 450 employees thrives in an inclusive culture that values individuals from diverse backgrounds, regardless of their level of sports fandom. Ready to reimagine the DFS industry together? Overview We’re...",
    "url": "https://remotive.com/remote-jobs/software-dev/martech-engineer-2011917",
    "salary": "$130,000 to $200,000",
    "job_type": "Full-time",
    "posted_date": "2025-05-22T20:50:36",
    "source": "remotive_api",
    "external_id": "2011917",
    "fetched_at": "2025-05-28T00:01:11.781809"
  },
  {
    "title": "Senior Full-Stack Engineer",
    "company": "Software Intelligence Works",
    "location": "Northern America, Americas, USA, Canada, USA timezones",
    "description": "Senior Full-Stack Engineer: Build the Missing Tool for Data ConnectorsWho We AreWe're creating what Cursor is to coding and Replit is to development environments, but for SaaS data connectors. We're small, US-based, profitable, and building something people actually need instead of chasing investor buzzwords.The RoleWe need a Senior Full-Stack Engineer who can own projects completely and ship quality code that works. This is a full-time, remote position available now for someone who wants to bui...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-full-stack-engineer-2011648",
    "salary": "$80 - $90K",
    "job_type": "Full-time",
    "posted_date": "2025-05-22T12:06:46",
    "source": "remotive_api",
    "external_id": "2011648",
    "fetched_at": "2025-05-28T00:01:11.781810"
  },
  {
    "title": "Applied Sr Data Scientist - Fintech Foundation",
    "company": "Hopper",
    "location": "Spain",
    "description": "About the job Hopper is continually redefining how people travel, combining a best-in-class travel agency with a portfolio of proprietary fintech offerings that give our customers peace of mind when booking travel. More than 100M monthly active users are exposed to our products through our mobile app and a growing list of partners such as CapitalOne, Air Canada, and Spirit Airlines. With a real-time feed of 50B+ priced itineraries daily along with more than ten years of history and multiple exte...",
    "url": "https://remotive.com/remote-jobs/software-dev/applied-sr-data-scientist-fintech-foundation-2011005",
    "salary": "competitive salary with pre-ipo equity",
    "job_type": "Full-time",
    "posted_date": "2025-05-22T02:50:27",
    "source": "remotive_api",
    "external_id": "2011005",
    "fetched_at": "2025-05-28T00:01:11.781812"
  },
  {
    "title": "Data Scientist",
    "company": "kitmanlabs",
    "location": "Ireland",
    "description": "Kitman Labs is the performance intelligence company, disrupting and transforming the way the sports industry uses data to unlock the potential of the world’s top athletes. Driven by a passion to innovate in the areas of sports performance, analytics and user experience, we have assembled a team of the industry’s top data scientists, sports performance scientists, product and software designers and engineers. Kitman Labs’ advanced operating system, the Intelligence Platform (iP) is now used by ov...",
    "url": "https://remotive.com/remote-jobs/software-dev/data-scientist-2011164",
    "salary": "competitive salary with equity and benefits",
    "job_type": "Full-time",
    "posted_date": "2025-05-22T02:50:25",
    "source": "remotive_api",
    "external_id": "2011164",
    "fetched_at": "2025-05-28T00:01:11.781814"
  },
  {
    "title": "Staff Software Engineer",
    "company": "Guild",
    "location": "USA",
    "description": "At Guild, we believe talent is everywhere and that opportunity should be too. We continue to have our home and headquarters in Denver, but we have embraced a distributed model of working to reach the best talent in the United States. While some roles may require proximity to our Denver office, roles based outside of our Denver office can sit in any of the following 32 states: AZ, CA, CO, CT, FL, GA, ID, IL, IN, KS, MA, MD, ME, MI, MN, MO, NC, NH, NJ, NV, NY, OH, OK, OR, PA, SC, TN, TX, UT, VA, W...",
    "url": "https://remotive.com/remote-jobs/software-dev/staff-software-engineer-2010565",
    "salary": "$161,300 - $215,000 base salary plus stock options",
    "job_type": "Full-time",
    "posted_date": "2025-05-21T22:51:00",
    "source": "remotive_api",
    "external_id": "2010565",
    "fetched_at": "2025-05-28T00:01:11.781816"
  },
  {
    "title": "Staff Software Engineer, Marketing Technology Orchestration",
    "company": "Airbnb",
    "location": "USA",
    "description": "Airbnb was born in 2007 when two hosts welcomed three guests to their San Francisco home, and has since grown to over 5 million hosts who have welcomed over 2 billion guest arrivals in almost every country across the globe. Every day, hosts offer unique stays and experiences that make it possible for guests to connect with communities in a more authentic way.The Community You Will Join: Marketing Technology’s mission is to connect with our vibrant community. We aim to enable marketing and produc...",
    "url": "https://remotive.com/remote-jobs/software-dev/staff-software-engineer-marketing-technology-orchestration-2010566",
    "salary": "$204,000 - $255,000 usd",
    "job_type": "Full-time",
    "posted_date": "2025-05-21T22:50:59",
    "source": "remotive_api",
    "external_id": "2010566",
    "fetched_at": "2025-05-28T00:01:11.781818"
  },
  {
    "title": "Senior Software Engineer",
    "company": "Remo",
    "location": "USA",
    "description": "About RemoRemo is building a new standard of dementia care by fundamentally changing the care journey for individuals living with dementia and their caregivers (the dyad). As a virtual dementia care provider, our expert clinical team designs personalized, comprehensive care to serve people with dementia and caregiver needs (instead of a one-size-fits-all approach). We empower family caregivers by connecting them with a vibrant community of other caregivers, expert content, and tools to manage th...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-software-engineer-2010567",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-21T22:50:59",
    "source": "remotive_api",
    "external_id": "2010567",
    "fetched_at": "2025-05-28T00:01:11.781820"
  },
  {
    "title": "Senior Software Engineer",
    "company": "Headspace",
    "location": "USA",
    "description": "About the Senior Software Engineer, Fullstack at Headspace: Headspace is seeking a talented Senior Software Engineer, Fullstack to join its Web Acquisition Team and be responsible for building out great web experiences and expanding access to and monetizing the audiences that Headspace can serve via D2C and SMB Channels. As part of this team, you'll be tasked with prototyping, architecting, and executing on the creation of our enterprise platform, and be integral in the platform's continued grow...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-software-engineer-2010570",
    "salary": "$122,400 - $195,500 + equity + benefits",
    "job_type": "Full-time",
    "posted_date": "2025-05-21T18:50:07",
    "source": "remotive_api",
    "external_id": "2010570",
    "fetched_at": "2025-05-28T00:01:11.781822"
  },
  {
    "title": "AI Engineer",
    "company": "Beamery",
    "location": "UK",
    "description": "ABOUT BEAMERYBeamery’s mission is to create equal access to work, skills, and careers. We are a leading transformational AI platform in the HR technology industry, enabling enterprise companies to create better and fairer talent decisions – by accelerating their recruiting processes, unlocking successful internal mobility opportunities, enabling smarter upskilling initiatives, and facilitating agile workforce planning. We are helping our clients hire and redeploy over a million people annually.O...",
    "url": "https://remotive.com/remote-jobs/software-dev/ai-engineer-2010631",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-21T10:50:08",
    "source": "remotive_api",
    "external_id": "2010631",
    "fetched_at": "2025-05-28T00:01:11.781824"
  },
  {
    "title": "Lead Solutions Engineer",
    "company": "Livestorm",
    "location": "Europe",
    "description": "About Livestorm:Livestorm is the world's leading end-to-end video engagement platform.Founded in 2016, Livestorm allows companies to organize powerful online meetings, webinars and virtual events from end-to-end. Our web-browser platform provides teams with all the workflows around video engagement to promote, host and analyze online events.Livestorm is built with ease of use in mind. We serve companies of all sizes, from startups to Fortune 500s. Brands like Shopify, Honda, Spendesk, Front and ...",
    "url": "https://remotive.com/remote-jobs/software-dev/lead-solutions-engineer-2011636",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-21T08:57:34",
    "source": "remotive_api",
    "external_id": "2011636",
    "fetched_at": "2025-05-28T00:01:11.781826"
  },
  {
    "title": "Senior Software Developer",
    "company": "Geotab",
    "location": "Spain",
    "description": "Who we are Geotab ® is a global leader in IoT and connected transportation and certified “Great Place to Work™.” We are a company of diverse and talented individuals who work together to help businesses grow and succeed, and increase the safety and sustainability of our communities. Geotab is advancing security, connecting commercial vehicles to the internet and providing web-based analytics to help customers better manage their fleets. Geotab’s open platform and Geotab Marketplace ®, offering h...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-software-developer-2010709",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-21T02:51:09",
    "source": "remotive_api",
    "external_id": "2010709",
    "fetched_at": "2025-05-28T00:01:11.781828"
  },
  {
    "title": "Principal Full Stack Engineer",
    "company": "Sayari",
    "location": "USA, UK, Canada",
    "description": "About Sayari: Sayari is the transparency company providing the public and private sectors with immediate visibility into complex commercial relationships by delivering the largest commercially available collection of corporate and trade data as a dynamic model of global ownership and trade activity. Sayari’s solutions harness this model to enable risk resilience, complex investigations, and clear-eyed business decisions. Sayari is headquartered in Washington, D.C., and its solutions are used by ...",
    "url": "https://remotive.com/remote-jobs/software-dev/principal-full-stack-engineer-2010714",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-21T00:50:49",
    "source": "remotive_api",
    "external_id": "2010714",
    "fetched_at": "2025-05-28T00:01:11.781830"
  },
  {
    "title": "Sr. Data Engineer II",
    "company": "Trueml",
    "location": "Argentina, Mexico, Dominican Republic",
    "description": "Why TrueML? TrueML is a mission-driven financial software company that aims to create better customer experiences for distressed borrowers. Consumers today want personal, digital-first experiences that align with their lifestyles, especially when it comes to managing finances. TrueML’s approach uses machine learning to engage each customer digitally and adjust strategies in real time in response to their interactions. The TrueML team includes inspired data scientists, financial services industry...",
    "url": "https://remotive.com/remote-jobs/software-dev/sr-data-engineer-ii-2010901",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-21T00:50:48",
    "source": "remotive_api",
    "external_id": "2010901",
    "fetched_at": "2025-05-28T00:01:11.781832"
  },
  {
    "title": "Senior Software Engineer",
    "company": "Minted",
    "location": "USA",
    "description": "The Role: We are seeking an experienced Full Stack Senior Software Engineer who is comfortable working with both front-end and back-end technologies. The ideal candidate will have proficiency in Python and JavaScript (React), experience with performance optimization, and a history of working with cross functional teams in a mid-to-large scale environment. In this role, you will be instrumental in enhancing the performance and scalability of our web applications, particularly within our shopping ...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-software-engineer-2010902",
    "salary": "$135,338 - $177,631",
    "job_type": "Full-time",
    "posted_date": "2025-05-20T20:50:15",
    "source": "remotive_api",
    "external_id": "2010902",
    "fetched_at": "2025-05-28T00:01:11.781834"
  },
  {
    "title": "Senior Software Engineer, Distributed Storage",
    "company": "Mystenlabs",
    "location": "Europe, UK",
    "description": "Mysten Labs believes that decentralized and open protocols are the bedrock of the internet of value. This is why at Mysten Labs, we are creating foundational infrastructure to accelerate the adoption of decentralized protocols based on blockchain technologies. Join the Walrus Core team at Mysten Labs, where you'll be at the forefront of building the company's newest distributed system: Walrus, an efficient decentralized storage network. The Core team is dedicated to developing the software that ...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-software-engineer-distributed-storage-2010903",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-20T18:50:37",
    "source": "remotive_api",
    "external_id": "2010903",
    "fetched_at": "2025-05-28T00:01:11.781836"
  },
  {
    "title": "Application Architect",
    "company": "Trinetix",
    "location": "Portugal, Poland, Ukraine, Bulgaria, Spain",
    "description": "We are looking for an experienced Cloud Architect to be a part of our Trinetix team. You will be involved in an innovative project with the ability to take an active part in architectural decisions. The product will help to build different business solutions. Your future dynamic and friendly team (25-30 people and more) consists of: Developers (Back-end and Front-end), QA Engineers, Application Architect, Technical Delivery Managers and Business Systems Analysts. Our teams consist of: Technical ...",
    "url": "https://remotive.com/remote-jobs/software-dev/application-architect-2008855",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-20T16:51:00",
    "source": "remotive_api",
    "external_id": "2008855",
    "fetched_at": "2025-05-28T00:01:11.781838"
  },
  {
    "title": "Odoo Developer",
    "company": "YouNav",
    "location": "Europe",
    "description": "Remote policy: Fully remote Remote location: Europe Company: YouNav Salary: 65-75k EUR (gross employer cost) Type of Employment: Full-time (CET hours) Long term Contractor (or Full-time employee in France only) About YouNav YouNav is the most advanced Marina Management System (MMS) on the market, managing 10,000+ berths and boaters, with 100+ marina staff users. Our software boosts boater satisfaction, streamlines marina operations, and frees up staff from repetitive tasks (younav.com). We’ve sp...",
    "url": "https://remotive.com/remote-jobs/software-dev/odoo-developer-1971901",
    "salary": "€65k - €75k",
    "job_type": "Full-time",
    "posted_date": "2025-05-20T07:14:08",
    "source": "remotive_api",
    "external_id": "1971901",
    "fetched_at": "2025-05-28T00:01:11.781840"
  },
  {
    "title": "VP of Engineering",
    "company": "Remofirst",
    "location": "UK, Portugal, Poland, South Africa, Romania, Spain",
    "description": "RemoFirst empowers employers to be free from geographical boundaries when accessing talent, allowing employees to pursue opportunities wherever they may exist. We are on a mission to be the FIRST to truly revolutionise the industry and be a generational company. Our platform offers a full-range people management tool, employee benefits like health insurance, and financial benefits, and enabling clients to hire anyone from anywhere with one click. RemoFirst manages employees and contractors for F...",
    "url": "https://remotive.com/remote-jobs/software-dev/vp-of-engineering-2008857",
    "salary": "competitive compensation",
    "job_type": "Full-time",
    "posted_date": "2025-05-20T06:50:41",
    "source": "remotive_api",
    "external_id": "2008857",
    "fetched_at": "2025-05-28T00:01:11.781841"
  },
  {
    "title": "Data Science Expert",
    "company": "IspeedToLead",
    "location": "Worldwide",
    "description": "Now we’re looking for a Data Science Expert who’s not just great with numbers, but hungry to build real things - models, insights, and features - that go live and make a measurable difference. What You’ll Be Doing: Own the design and development of machine learning models, forecasting systems, and lead scoring algorithms Turn messy, high-volume data into clear business signals and predictive insights Work cross-functionally with product, engineering, and growth to embed models into the product a...",
    "url": "https://remotive.com/remote-jobs/software-dev/data-science-expert-2011185",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-20T03:55:52",
    "source": "remotive_api",
    "external_id": "2011185",
    "fetched_at": "2025-05-28T00:01:11.781843"
  },
  {
    "title": "Senior Software Engineer",
    "company": "Hatch IT",
    "location": "USA",
    "description": "hatch I.T. is partnering with Brevity to find a Sr. Software Engineer. See details below:About the Role:Brevity is looking for a hands-on Senior Software Engineer who loves shipping production code and owning product features end-to-end. You will build across their Python/Django + React stack, help evolve their architecture as usage grows 10×, and champion engineering best practices. This is intended as a pure IC role – minimal people management and minimal business-side meetings.About the Compa...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-software-engineer-2008858",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-20T00:51:04",
    "source": "remotive_api",
    "external_id": "2008858",
    "fetched_at": "2025-05-28T00:01:11.781846"
  },
  {
    "title": "Middle .Net Developer for CRM Team",
    "company": "Gr8tech",
    "location": "Worldwide",
    "description": "GR8 Tech is a global product company that provides innovative, scalable platforms and business solutions for the iGaming industry. We have а great experience: GR8 Tech platform successfully handles millions of active players and offers best practices to develop and grow in the gambling industry. We are here to provide great gaming tech to satisfy even greater ambition! We develop complete tech coverage for gambling businesses worldwide, including iGaming platform solutions, consulting, integrati...",
    "url": "https://remotive.com/remote-jobs/software-dev/middle-net-developer-for-crm-team-2008859",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-20T00:51:00",
    "source": "remotive_api",
    "external_id": "2008859",
    "fetched_at": "2025-05-28T00:01:11.781847"
  },
  {
    "title": "Software Engineer",
    "company": "SandboxAQ",
    "location": "Europe, USA, Canada",
    "description": "About SandboxAQ SandboxAQ is a high-growth company delivering AI solutions that address some of the world's greatest challenges. The company’s Large Quantitative Models (LQMs) power advances in life sciences, financial services, navigation, cybersecurity, and other sectors.We are a global team that is tech-focused and includes experts in AI, chemistry, cybersecurity, physics, mathematics, medicine, engineering, and other specialties. The company emerged from Alphabet Inc. as an independent, grow...",
    "url": "https://remotive.com/remote-jobs/software-dev/software-engineer-2009691",
    "salary": "$167k - $234k per year",
    "job_type": "Full-time",
    "posted_date": "2025-05-19T22:51:03",
    "source": "remotive_api",
    "external_id": "2009691",
    "fetched_at": "2025-05-28T00:01:11.781849"
  },
  {
    "title": "Backend Software Engineer",
    "company": "doxel",
    "location": "India",
    "description": "Construction is the 2nd largest industry in the world (4x the size of SaaS!). But unlike software (with observability platforms such as AppDynamics and Datadog), construction teams lack automated feedback loops to help projects stay on schedule and on budget. Without this observability, construction wastes a whopping $3T per year because glitches aren’t detected fast enough to recover.Doxel AI exists to bring computer vision to construction, so the industry can deliver what society needs to thri...",
    "url": "https://remotive.com/remote-jobs/software-dev/backend-software-engineer-2009693",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-19T22:51:02",
    "source": "remotive_api",
    "external_id": "2009693",
    "fetched_at": "2025-05-28T00:01:11.781851"
  },
  {
    "title": "Product Security Engineer",
    "company": "Calendly",
    "location": "USA",
    "description": "About the team &amp; opportunity What’s so great about working on Calendly’s Security team? Calendly is growing rapidly and is scaling its security team to ensure the security of its users. You will have the chance to work with a small team of exceptional security engineers to build Calendly’s security practice from the ground up. Why do we need you? Well, we are looking for a Security Engineer who will bring significant application and infrastructure security skills, automation experience, and ...",
    "url": "https://remotive.com/remote-jobs/software-dev/product-security-engineer-2009698",
    "salary": "$127,500 - $207,000 usd",
    "job_type": "Full-time",
    "posted_date": "2025-05-19T16:51:04",
    "source": "remotive_api",
    "external_id": "2009698",
    "fetched_at": "2025-05-28T00:01:11.781853"
  },
  {
    "title": "Engineering Manager, AI Platform",
    "company": "Vanta",
    "location": "USA",
    "description": "At Vanta, our mission is to secure the internet and protect consumer data. We believe that security should be monitored and verified continuously, and we empower companies to practice better security and prove it with ease. Vanta has a kind and talented team, and while some have prior security experience, many have been successful at Vanta without it. We are seeking an experienced Engineering Manager to lead our AI Platform team. This team is dedicated to building the AI experience for our engin...",
    "url": "https://remotive.com/remote-jobs/software-dev/engineering-manager-ai-platform-2009760",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-19T04:51:10",
    "source": "remotive_api",
    "external_id": "2009760",
    "fetched_at": "2025-05-28T00:01:11.781855"
  },
  {
    "title": "Frontend Engineer",
    "company": "Kota",
    "location": "USA",
    "description": "About Kota:Kota is making insurance and retirement benefits as accessible as modern software. We do this across the Kota Platform - the world’s first fully integrated benefits platform and Kota Embed - our embedded insurance and retirement product for platforms.Our mission is to make insurance and benefits more accessible and delightful to this generation of employees.Kota was started in 2022 and has raised €7.6m from Europe’s top technology investors, including EQT Ventures, Northzone, Frontlin...",
    "url": "https://remotive.com/remote-jobs/software-dev/frontend-engineer-2009845",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-19T00:50:34",
    "source": "remotive_api",
    "external_id": "2009845",
    "fetched_at": "2025-05-28T00:01:11.781857"
  },
  {
    "title": "Machine Learning Engineer",
    "company": "NoGood",
    "location": "Egypt",
    "description": "We're Hiring: Machine Learning Engineer (1–2 Years Experience) We Are: NoGood is a leading growth, performance, and creator marketing agency at the intersection of performance science and creative storytelling. We empower impactful brands to achieve sustainable growth through innovative strategies, cutting-edge analytics, and creative experimentation. Our dynamic team combines top-tier talent, technology, and proprietary AI-driven solutions to deliver unparalleled marketing results for industry-...",
    "url": "https://remotive.com/remote-jobs/software-dev/machine-learning-engineer-2009761",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-19T00:50:34",
    "source": "remotive_api",
    "external_id": "2009761",
    "fetched_at": "2025-05-28T00:01:11.781859"
  },
  {
    "title": "Java / Kotlin Tooling Engineer",
    "company": "VirtusLab",
    "location": "Europe",
    "description": "We are #VLteam – tech enthusiasts constantly striving for growth. The team is our foundation, that’s why we care the most about the friendly atmosphere, a lot of self-development opportunities and good working conditions. Trust and autonomy are two essential qualities that drive our performance. We simply believe in the idea of ​​“measuring outcomes, not hours”. Join us &amp; see for yourself!Java / Kotlin Tooling Engineer (Senior)Java AdvancedBazel or Gradle/ Maven / CMake AdvancedEnglish Advan...",
    "url": "https://remotive.com/remote-jobs/software-dev/java-kotlin-tooling-engineer-2009847",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-18T22:50:47",
    "source": "remotive_api",
    "external_id": "2009847",
    "fetched_at": "2025-05-28T00:01:11.781861"
  },
  {
    "title": "Software Configuration Specialist III-Policy",
    "company": "LE008 Duck Creek Technologies India LLP",
    "location": "India",
    "description": "This description is a summary of our understanding of the job description. Click on 'Apply' button to find out more. Role Description As a member of a project team, the Software Configuration Specialist III is an experienced resource responsible for delivering technical implementation tasks for customers. Assumes ownership of designs and processes while working independently with little to no supervision. May lead a small team in configuring, building, and testing the application. Develops and i...",
    "url": "https://remotive.com/remote-jobs/software-dev/software-configuration-specialist-iii-policy-2009850",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-18T22:50:47",
    "source": "remotive_api",
    "external_id": "2009850",
    "fetched_at": "2025-05-28T00:01:11.781863"
  },
  {
    "title": "Senior Security Engineer",
    "company": "Mariadbplc",
    "location": "Bulgaria",
    "description": "MariaDB is making a big impact on the world. Whether you’re checking your bank account, buying a coffee, shopping online, making a phone call, listening to music, taking out a loan or ordering takeout – MariaDB is the backbone of applications used every day. Companies small and large, including 75% of the Fortune 500 run MariaDB, touching the lives of billions of people. With massive reach through Linux distributions, enterprise deployments, and public clouds, MariaDB is uniquely positioned as t...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-security-engineer-2009958",
    "salary": "competitive salary based on local structures",
    "job_type": "Full-time",
    "posted_date": "2025-05-18T22:50:46",
    "source": "remotive_api",
    "external_id": "2009958",
    "fetched_at": "2025-05-28T00:01:11.781865"
  },
  {
    "title": "Sr. Salesforce Developer",
    "company": "Veracyte",
    "location": "USA",
    "description": "At Veracyte, we offer exciting career opportunities for those interested in joining a pioneering team that is committed to transforming cancer care for patients across the globe. Working at Veracyte – whether it be in one of our labs, corporate offices, the field – enables our employees to not only make a meaningful impact on the lives of patients, but to also learn and grow within a results-driven environment that values innovation, collaboration, and compassion.The Position: We are seeking a h...",
    "url": "https://remotive.com/remote-jobs/software-dev/sr-salesforce-developer-2009961",
    "salary": "$155,000 - $181,000 usd",
    "job_type": "Full-time",
    "posted_date": "2025-05-18T16:50:50",
    "source": "remotive_api",
    "external_id": "2009961",
    "fetched_at": "2025-05-28T00:01:11.781867"
  },
  {
    "title": "Senior Microsoft PowerBI Developer",
    "company": "Proxify",
    "location": "CET +/- 3 HOURS",
    "description": "The Role: We are looking for a Senior Microsoft Power BI developer for one of our clients. You are a perfect candidate if you are growth-oriented, you love what you do, and you enjoy working on new ideas to develop exciting products and growth features. What we are looking for: Background with BI tools and systems such as Power BI, Tableau, and SAP Prior experience in data-related tasks Understanding of the Microsoft BI Stack Mastery in data analytics Proficiency in software development Familiar...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-microsoft-powerbi-developer-1359476",
    "salary": "$50k-$80k",
    "job_type": "Contract",
    "posted_date": "2025-05-18T07:31:08",
    "source": "remotive_api",
    "external_id": "1359476",
    "fetched_at": "2025-05-28T00:01:11.781869"
  },
  {
    "title": "AI Enablement Developer",
    "company": "Gcore",
    "location": "Europe",
    "description": "Company DescriptionHave you ever wondered why your favorite apps, social media content, and video games load in the blink of an eye? It's likely because of Gcore behind the scenes! Join a team that collaborates with industry giants like Intel, Dell, NVIDIA, Graphcore, and Equinix to accelerate AI training, provide cutting-edge cloud services, and optimize content delivery. If you are passionate about transforming the internet and contributing to cutting-edge innovations, come join us at Gcore! W...",
    "url": "https://remotive.com/remote-jobs/software-dev/ai-enablement-developer-2009963",
    "salary": "competitive salary",
    "job_type": "Full-time",
    "posted_date": "2025-05-18T02:50:17",
    "source": "remotive_api",
    "external_id": "2009963",
    "fetched_at": "2025-05-28T00:01:11.781871"
  },
  {
    "title": "Senior Data Engineer",
    "company": "J.D. Power",
    "location": "Canada",
    "description": "Title: Data &amp; Analytics Senior Data Engineer - P4 Location: Remote Canada Reports To: Data Science &amp; Engineering - Vice President The Role: JD Power is looking for a senior data engineer with excellent quantitative and analytical skills. Our ideal candidates are determined to use their skills to combine multiple data sources together to solve complex client questions around vehicle valuations, market readiness, and customer purchase decisions. You’ll work hands on with quantitative data ...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-data-engineer-2009964",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-17T22:51:00",
    "source": "remotive_api",
    "external_id": "2009964",
    "fetched_at": "2025-05-28T00:01:11.781873"
  },
  {
    "title": "Python & Typescript Developer",
    "company": "Varicent",
    "location": "Mexico",
    "description": "At Varicent, we’re not just transforming the Sales Performance Management (SPM) market—we’re redefining how organizations achieve revenue success. Our cutting-edge SaaS solutions empower revenue leaders globally to design smarter go-to-market strategies, maximize seller performance, and unlock untapped potential. Varicent stands at the forefront of innovation, celebrated as a market leader in the 2025 Forrester Wave Report for SPM, 2023 Ventana Research Revenue Performance Management (RPM) Value...",
    "url": "https://remotive.com/remote-jobs/software-dev/python-typescript-developer-2009965",
    "salary": "market leading compensation package",
    "job_type": "Full-time",
    "posted_date": "2025-05-17T22:50:59",
    "source": "remotive_api",
    "external_id": "2009965",
    "fetched_at": "2025-05-28T00:01:11.781875"
  },
  {
    "title": "Senior Software Engineer",
    "company": "Trellis",
    "location": "USA",
    "description": "Trellis is a profitable, fast-growing Series A startup backed by top investors like General Catalyst, QED, NYCA, and Amex Ventures. Our mission: make shopping for home and auto insurance faster, smarter, and easier for everyday Americans. Powered by ML and GenAI, we help people find better insurance — saving them time, money, and stress. We’re fully remote, built for speed, and led by a third-time fintech founder with a track record of building public companies. If you move fast, take ownership,...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-software-engineer-2009967",
    "salary": "75th-percentile competitive compensation",
    "job_type": "Full-time",
    "posted_date": "2025-05-17T22:50:58",
    "source": "remotive_api",
    "external_id": "2009967",
    "fetched_at": "2025-05-28T00:01:11.781877"
  },
  {
    "title": "Senior Backend Developer",
    "company": "Bridgit",
    "location": "Canada",
    "description": "What you will doAs a Senior Backend Developer at Bridgit, you’ll take ownership of designing, testing, and building new backend solutions, while also extending and maintaining our existing systems. You'll focus on creating scalable, reliable infrastructure that powers real impact for our customers. We're especially excited about candidates who are curious about the evolving role of AI and eager to explore how technologies like large language models can enhance our product and developer experienc...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-backend-developer-2008862",
    "salary": "competitive salary and equity options",
    "job_type": "Full-time",
    "posted_date": "2025-05-17T20:51:20",
    "source": "remotive_api",
    "external_id": "2008862",
    "fetched_at": "2025-05-28T00:01:11.781879"
  },
  {
    "title": "Kotlin Backend Developer",
    "company": "interim Group",
    "location": "Germany",
    "description": "We are looking for people who want to shape the future with us. As part of SPRIND, an organization that is called the “Federal Agency for Breakthrough Innovations” but thinks like a start-up. Our goal is to create new breakthrough innovations from Germany. That means products, services and systems that make all of our lives noticeably and sustainably better. To do this, we connect new thinkers from science and business, people with outstanding ideas, special expertise and passion. In the “EUDI W...",
    "url": "https://remotive.com/remote-jobs/software-dev/kotlin-backend-developer-2010024",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-17T20:51:20",
    "source": "remotive_api",
    "external_id": "2010024",
    "fetched_at": "2025-05-28T00:01:11.781881"
  },
  {
    "title": "Senior Backend Engineer",
    "company": "Gt Hq",
    "location": "Europe",
    "description": "GT was founded in 2019 by a former Apple, Nest, and Google executive. GT’s mission is to connect the world’s best talent with product careers offered by high-growth companies in the UK, USA, Canada, Germany, and the Netherlands.On behalf of our partner in the defence-tech domain, GT is looking for a Senior Backend Engineer interested in AI, ML and aerospace.About the Client: Our client is a cutting-edge Aerospace and Defense company committed to delivering innovative, secure, and compliant solut...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-backend-engineer-2008964",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-17T20:51:19",
    "source": "remotive_api",
    "external_id": "2008964",
    "fetched_at": "2025-05-28T00:01:11.781883"
  },
  {
    "title": "IOS SDK Developer",
    "company": "ONVY",
    "location": "Germany",
    "description": "ONVY HealthTech Group GmbH is a Munich-based Digital Health company pioneering a new era of proactive and personalized health management. Our AI-powered platform integrates data from over 320 wearables and health services, providing users with actionable insights to optimize their physical and mental well-being. By translating diverse health metrics into personalized recommendations, ONVY empowers individuals to balance their lifestyle choices, enhancing recovery, performance, sleep, nutrition, ...",
    "url": "https://remotive.com/remote-jobs/software-dev/ios-sdk-developer-2009158",
    "salary": "",
    "job_type": "Freelance",
    "posted_date": "2025-05-17T00:50:07",
    "source": "remotive_api",
    "external_id": "2009158",
    "fetched_at": "2025-05-28T00:01:11.781885"
  },
  {
    "title": "Ruby Engineer",
    "company": "Maximon",
    "location": "Worldwide",
    "description": "Are you ready to use your engineering skills to make a real difference in how we age? Join Maximon in building the future of longevity. You’ll play a key role in developing both our internal infrastructure and a brand-new, customer-facing AI Health Platform that has the potential to change lives. About Us Maximon is a longevity investor and company builder with the vision of becoming a leading player in the field of healthy aging and lifespan extension. We empower exceptional entrepreneurs to la...",
    "url": "https://remotive.com/remote-jobs/software-dev/ruby-engineer-2009160",
    "salary": "",
    "job_type": "Freelance",
    "posted_date": "2025-05-16T22:50:13",
    "source": "remotive_api",
    "external_id": "2009160",
    "fetched_at": "2025-05-28T00:01:11.781887"
  },
  {
    "title": "Software Engineer",
    "company": "Litify",
    "location": "USA",
    "description": "About Us At Litify, we’re revolutionizing the Legal industry by being the platform powering legal’s top performers. As a trailblazer in legal technology, Litify delivers an all-in-one legal operating solution that empowers law firms and legal departments to achieve consistent success by continually standardizing, measuring, and improving their legal operations. Our mission is clear: to deliver better business outcomes to our clients, so they can focus on delivering the best legal service and out...",
    "url": "https://remotive.com/remote-jobs/software-dev/software-engineer-2009162",
    "salary": "$110,000-120,000",
    "job_type": "Full-time",
    "posted_date": "2025-05-16T22:50:12",
    "source": "remotive_api",
    "external_id": "2009162",
    "fetched_at": "2025-05-28T00:01:11.781889"
  },
  {
    "title": "Sr. Software Engineer",
    "company": "Iconic Air",
    "location": "USA",
    "description": "Sr. Software EngineerREMOTE / SOFTWARE ENGINEERING / FULL-TIME Iconic Air is on a mission to catalyze emissions management in an impactful, data-driven manner. We are a software company providing the tools and knowledge focused on emissions performance for the world's most energy-intensive industries such as oil and gas, power and utilities, and heavy manufacturing. We equip our customers to efficiently track, report, and reduce leaks and greenhouse gas emissions through automation, analytics, a...",
    "url": "https://remotive.com/remote-jobs/software-dev/sr-software-engineer-2009315",
    "salary": "competitive salary and stock options",
    "job_type": "Full-time",
    "posted_date": "2025-05-16T20:50:08",
    "source": "remotive_api",
    "external_id": "2009315",
    "fetched_at": "2025-05-28T00:01:11.781891"
  },
  {
    "title": "Junior C# Developer",
    "company": "Civitta",
    "location": "Ukraine",
    "description": "Ready to embark on a journey of opportunity? Join a team of 750+ employees in 20+ countries in the first consultancy originating from CEE. We bring together digital and advisory as an international collaboratory where every talent can shine, every employee can become a partner, and every partner can become a shareholder. We are explorers at heart, powered by diversity, passionate for growth and united by integrity by our core organizational values.Do you believe technology should work for the pe...",
    "url": "https://remotive.com/remote-jobs/software-dev/junior-c-developer-2009316",
    "salary": "competitive salary",
    "job_type": "Full-time",
    "posted_date": "2025-05-16T20:50:07",
    "source": "remotive_api",
    "external_id": "2009316",
    "fetched_at": "2025-05-28T00:01:11.781893"
  },
  {
    "title": "Senior Independent Software Developer",
    "company": "A.Team",
    "location": "Americas, Europe, Israel",
    "description": "You must be located in the Americas, Europe, or Israel to apply.A·Team is a VC-backed, stealth, application-only home on the internet for senior independent software builders to team up with hand-picked, high-growth companies on their next big thing. After talking with hundreds of independent engineers, designers, and product folks, we heard over and over that finding vetted, high-quality, consistent clients is hard, and projects are often too small to be rewarding. A·Team matches small teams of...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-independent-software-developer-1919265",
    "salary": "$90 - $150 /hour",
    "job_type": "Contract",
    "posted_date": "2025-05-16T10:16:00",
    "source": "remotive_api",
    "external_id": "1919265",
    "fetched_at": "2025-05-28T00:01:11.781895"
  },
  {
    "title": "Senior Java Software Engineer",
    "company": "InPost",
    "location": "Poland",
    "description": "Company DescriptionInPost Group is an innovative European out of home deliveries company, revolutionizing the way parcels are delivered to customers. With operations across several countries, our network of intelligent lockers provides customers with a fast, convenient, and secure delivery option. InPost Group is a publicly traded company, with a market capitalization of about $5 billion as of March 2023. With over 10,000 employees worldwide, InPost Group is one of the largest out of home delive...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-java-software-engineer-2009421",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-15T20:50:28",
    "source": "remotive_api",
    "external_id": "2009421",
    "fetched_at": "2025-05-28T00:01:11.781897"
  },
  {
    "title": "Lead Software Engineer",
    "company": "VirtuHire",
    "location": "South Africa",
    "description": "About the Company Mission: Deliver precision medicine to everyone in the world within 24 hours Vision: Become the OS for healthcare and life sciences using agentic AI and active learning Culture: Flat hierarchy, hacker culture, extreme ownership RequirementsKey Responsibilities Develop and extend mission-critical healthcare product lines Build scalable backend and full-stack systems Work across UX, infrastructure, and ML-integrated product experiences Lead full product cycles from ideation to pr...",
    "url": "https://remotive.com/remote-jobs/software-dev/lead-software-engineer-2009425",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-15T20:50:27",
    "source": "remotive_api",
    "external_id": "2009425",
    "fetched_at": "2025-05-28T00:01:11.781899"
  },
  {
    "title": "Software Engineer",
    "company": "Livekit",
    "location": "USA",
    "description": "At LiveKit, we build open-source APIs to power the future of computing. We are a company of engineers building software stacks for other engineers.You'll thrive at LiveKit if you:obsess with crafting code that is fast, reliable and practical for the problemare known as the go-to person for tackling tough technical problemswork hard and can both build and ship fastcan clearly explain complex technical concepts to othersare a fast learner, frequently picking up new languages and toolsThe best way ...",
    "url": "https://remotive.com/remote-jobs/software-dev/software-engineer-2009424",
    "salary": "competitive salary and equity package",
    "job_type": "Full-time",
    "posted_date": "2025-05-15T20:50:27",
    "source": "remotive_api",
    "external_id": "2009424",
    "fetched_at": "2025-05-28T00:01:11.781902"
  },
  {
    "title": "Senior Backend Engineer, Recommendations",
    "company": "Constructor",
    "location": "Spain",
    "description": "Constructor is the only search and product discovery platform tailor-made for enterprise ecommerce where conversions matter. Constructor's AI-first solutions make it easier for shoppers to discover products they want to buy and for ecommerce teams to deliver highly personalized experiences that drive impressive results. Optimizing specifically for ecommerce metrics like revenue, conversion rate and profit, Constructor generates consistent $10M+ lifts for some of the biggest brands in ecommerce, ...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-backend-engineer-recommendations-2008476",
    "salary": "base range of 80-110k usd + stock options",
    "job_type": "Full-time",
    "posted_date": "2025-05-15T20:50:25",
    "source": "remotive_api",
    "external_id": "2008476",
    "fetched_at": "2025-05-28T00:01:11.781903"
  },
  {
    "title": "Senior Application Engineer",
    "company": "Mozilla",
    "location": "Canada",
    "description": "To learn the Hiring Ranges for this position, please select your location from the Apply Now dropdown menu. To learn more about our Hiring Range System, please click this link. Why Mozilla? Mozilla Corporation is the non-profit-backed technology company that has shaped the internet for the better over the last 25 years. We make pioneering brands like Firefox, the privacy-minded web browser, and Pocket, a service for keeping up with the best content online. Now, with more than 225 million people ...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-application-engineer-2009155",
    "salary": "$104,000 - $139,000 cad",
    "job_type": "Full-time",
    "posted_date": "2025-05-15T20:50:23",
    "source": "remotive_api",
    "external_id": "2009155",
    "fetched_at": "2025-05-28T00:01:11.781905"
  },
  {
    "title": "Public Sector Full Stack Engineer",
    "company": "Snowflake",
    "location": "USA",
    "description": "Build the future of the AI Data Cloud. Join the Snowflake team.We’re at the forefront of the data revolution, committed to building the world’s greatest data and applications platform. Snowflake started with a clear vision: develop a cloud data platform that is effective, affordable, and accessible to all data users. Snowflake developed an innovative new product with a built-for-the-cloud architecture that combines the power of data warehousing, the flexibility of big data platforms, and the ela...",
    "url": "https://remotive.com/remote-jobs/software-dev/public-sector-full-stack-engineer-2007371",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-15T18:50:45",
    "source": "remotive_api",
    "external_id": "2007371",
    "fetched_at": "2025-05-28T00:01:11.781907"
  },
  {
    "title": "Frontend Developer",
    "company": "Quinncia",
    "location": "Worldwide",
    "description": "(All applications will be considered ONLY through Wellfound link only. Please do not contact any employee of the company as no such contact/connection will be considered as an application for the job.)Salary: $20k – $35k • No equity This posting is for a Frontend Developer, you would work alongside our team. We are a fully remote team so it does not matter which country or time zone you are in, as long as you are available from 10 AM to 1 PM (EST). We are NOT looking for part-time work, contract...",
    "url": "https://remotive.com/remote-jobs/software-dev/frontend-developer-2009574",
    "salary": "$20k – $35k",
    "job_type": "Full-time",
    "posted_date": "2025-05-15T15:08:00",
    "source": "remotive_api",
    "external_id": "2009574",
    "fetched_at": "2025-05-28T00:01:11.781909"
  },
  {
    "title": "Web Designer",
    "company": "Contra",
    "location": "Worldwide",
    "description": "We’re seeking a freelance web designer/developer to lead a website rebuild. This project involves creating a clean-slate, product-led Webflow site that communicates our value and drives conversions. What You’ll Do Design a modern brand look based on our logo, color palette, and product UI. Build a responsive Webflow homepage with modular sections for product details and value propositions. Create key subpages (Pricing, Blog, Legal, Contact) with CMS integration for easy updates. Implement basic ...",
    "url": "https://remotive.com/remote-jobs/software-dev/web-designer-2009129",
    "salary": "$4k - $8k total",
    "job_type": "Freelance",
    "posted_date": "2025-05-14T23:09:04",
    "source": "remotive_api",
    "external_id": "2009129",
    "fetched_at": "2025-05-28T00:01:11.781912"
  },
  {
    "title": "Senior Frontend Software Engineer",
    "company": "Clarium",
    "location": "Worldwide",
    "description": "About Clarium Health Clarium Health is transforming healthcare supply chain operations through our AI-powered data platform. Our solutions help healthcare providers increase visibility, optimize clinical inventory, and build resilience in their supply chains. We're experiencing rapid growth and expanding our product portfolio to address critical challenges in healthcare operations. What You’ll Do Develop web applications using React, TypeScript, UX Frameworks, and state management libraries. Bui...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-frontend-software-engineer-2007374",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-14T18:50:51",
    "source": "remotive_api",
    "external_id": "2007374",
    "fetched_at": "2025-05-28T00:01:11.781914"
  },
  {
    "title": "Staff Machine Learning Engineer",
    "company": "SmarterDx",
    "location": "USA",
    "description": "Role We are looking for a Staff Machine Learning Engineer to help us build a best in class ML Ecosystem to advance our product suite with clinical AI. The ideal candidate works exceptionally well across disciplines and delivers high quality outcomes continuously, with a relentless focus on reliable systems and developer experience. SmarterDx builds clinical AI that empowers hospitals to analyze the complete record of every patient to fully capture the value of care delivered. Founded by physicia...",
    "url": "https://remotive.com/remote-jobs/software-dev/staff-machine-learning-engineer-2007437",
    "salary": "$220-270k base + equity incentives",
    "job_type": "Full-time",
    "posted_date": "2025-05-14T18:50:50",
    "source": "remotive_api",
    "external_id": "2007437",
    "fetched_at": "2025-05-28T00:01:11.781916"
  },
  {
    "title": "Robotics Generalist, Expansion",
    "company": "Serve Robotics",
    "location": "USA, Canada",
    "description": "At Serve Robotics, we’re reimagining how things move in cities. Our personable sidewalk robot is our vision for the future. It’s designed to take deliveries away from congested streets, make deliveries available to more people, and benefit local businesses. The Serve fleet has been delighting merchants, customers, and pedestrians along the way in Los Angeles while doing commercial deliveries. We’re looking for talented individuals who will grow robotic deliveries from surprising novelty to effic...",
    "url": "https://remotive.com/remote-jobs/software-dev/robotics-generalist-expansion-2007521",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-14T18:50:46",
    "source": "remotive_api",
    "external_id": "2007521",
    "fetched_at": "2025-05-28T00:01:11.781918"
  },
  {
    "title": "App Developer",
    "company": "NeuroNation",
    "location": "Germany",
    "description": "About NeuroNation NeuroNation is a leading brain training platform used by over 30 million people worldwide. We collaborate closely with scientists and universities to deliver engaging, medically certified digital health solutions. Our mobile and web applications have been recognized by Apple , Google, and major health insurance companies. In Germany, our medical app is DiGA-listed and prescribed by doctors, with costs covered by public health insurance. We are on a mission to help people lead h...",
    "url": "https://remotive.com/remote-jobs/software-dev/app-developer-2007524",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-14T16:50:14",
    "source": "remotive_api",
    "external_id": "2007524",
    "fetched_at": "2025-05-28T00:01:11.781920"
  },
  {
    "title": "Web3 Engineering Manager & Tech Lead",
    "company": "Metawealth",
    "location": "Europe",
    "description": "MetaWealth is an investment platform that tokenizes real estate assets through blockchain technology, transforming physical properties into digital tokens representing ownership stakes. This approach lowers the entry threshold for investors and enhances transparency, security, and efficiency by leveraging smart contracts and decentralized finance (DeFi) mechanisms. At MetaWealth, we are passionate about empowering retail investors to take control of their financial future. We believe that everyo...",
    "url": "https://remotive.com/remote-jobs/software-dev/web3-engineering-manager-tech-lead-2007525",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-14T16:50:13",
    "source": "remotive_api",
    "external_id": "2007525",
    "fetched_at": "2025-05-28T00:01:11.781921"
  },
  {
    "title": "Staff Software Engineer, Query Applications",
    "company": "dbt Labs",
    "location": "USA",
    "description": "About Us dbt Labs is the pioneer of analytics engineering, helping data teams transform raw data into reliable, actionable insights. Since 2016, we’ve grown from an open source project into the leading analytics engineering platform, now used by over 50,000 teams every week. As of February 2025, we’ve surpassed $100 million in annual recurring revenue (ARR) and serve more than 5,100 dbt Cloud customers, including JetBlue, HubSpot, Vodafone New Zealand, and Dunelm. We’re backed by top-tier invest...",
    "url": "https://remotive.com/remote-jobs/software-dev/staff-software-engineer-query-applications-2007529",
    "salary": "$172,000 - $207,900 usd",
    "job_type": "Full-time",
    "posted_date": "2025-05-14T16:50:12",
    "source": "remotive_api",
    "external_id": "2007529",
    "fetched_at": "2025-05-28T00:01:11.781923"
  },
  {
    "title": "(Senior) Frontend Engineer- New Platform",
    "company": "Scalable",
    "location": "Germany",
    "description": "Company DescriptionScalable Capital is a leading digital investment platform in Europe. The company empowers everyone to shape their financial future. Scalable Broker makes it easy and affordable for clients to invest professionally in stocks, ETFs and other exchange-traded products and set up savings plans. Scalable Wealth, the digital wealth management service, offers clients professional investment in ETF portfolios and is also adopted as a white-label solution by renowned B2B partners. With ...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-frontend-engineer-new-platform-2007634",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-14T16:50:09",
    "source": "remotive_api",
    "external_id": "2007634",
    "fetched_at": "2025-05-28T00:01:11.781925"
  },
  {
    "title": "Senior Magento Developer",
    "company": "Proxify",
    "location": "CET +/- 3 HOURS",
    "description": "The Role: We are looking for a Senior Magento II Developer for one of our clients. You are a perfect candidate if you are growth-oriented, you love what you do, and you enjoy working on new ideas to develop exciting products and growth features. What we are looking for: 5+ years of extensive experience with Magento II, JavaScript, HTML, PHP, CSS, and MySQL Expert understanding of Magento's code structure, extension architecture, theming hierarchy, and fallback components. Competency in authoring...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-magento-developer-1591692",
    "salary": "$45k - $80k",
    "job_type": "Full-time",
    "posted_date": "2025-05-14T16:31:06",
    "source": "remotive_api",
    "external_id": "1591692",
    "fetched_at": "2025-05-28T00:01:11.781927"
  },
  {
    "title": "Senior Performance Engineer",
    "company": "Real-Time Innovations",
    "location": "Spain",
    "description": "Are you passionate about pushing software systems to their limits and ensuring they perform flawlessly in critical environments? We are seeking a highly skilled Performance Testing Engineer to join our team and make a tangible impact by driving the performance characterization and optimization of Connext Micro, Cert and TSS products. In this role, you'll work on performance modeling, workload characterization, and bottleneck analysis to unlock the full potential of our systems. You will leverage...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-performance-engineer-2007639",
    "salary": "annual bonus based on performance",
    "job_type": "Full-time",
    "posted_date": "2025-05-13T16:50:17",
    "source": "remotive_api",
    "external_id": "2007639",
    "fetched_at": "2025-05-28T00:01:11.781929"
  },
  {
    "title": "Senior Software Engineer",
    "company": "Givebutter",
    "location": "USA",
    "description": "Company DescriptionGivebutter is the most-loved nonprofit fundraising and CRM platform, empowering millions of changemakers to raise more, pay less, and give better. Nonprofits use Givebutter to replace multiple tools so they can launch fundraisers and events, use donation forms and donor management (CRM), send emails and text blasts—all in one place. Use of the Givebutter platform is completely free with a 100% transparent tip-or-fee model.Givebutter has been certified as a Great Place to Work®...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-software-engineer-2007857",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-13T16:50:16",
    "source": "remotive_api",
    "external_id": "2007857",
    "fetched_at": "2025-05-28T00:01:11.781931"
  },
  {
    "title": "Senior Software Engineer",
    "company": "Bluecore",
    "location": "India",
    "description": "In the minute it takes you to read this job description, Bluecore has launched over 100,000 individually personalized marketing campaigns for our retail ecommerce customers!Senior Software Engineer We are looking for a Senior Software Engineer - Platform Engineering to help our engineering teams build scalable, extensible, reliable, and performant systems. The role will be hands-on: optimizing our Kubernetes clusters, managing our GCP infrastructure, and improving our DevOps and SRE practices. L...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-software-engineer-2007859",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-13T16:50:14",
    "source": "remotive_api",
    "external_id": "2007859",
    "fetched_at": "2025-05-28T00:01:11.781933"
  },
  {
    "title": "Enterprise Identity Engineer",
    "company": "New Era Technology",
    "location": "USA",
    "description": "Join New Era Technology, where People First is at the heart of everything we do. With a global team of over 4,500 professionals, we’re committed to creating a workplace where everyone feels valued, empowered, and inspired to grow. Our mission is to securely connect people, places, and information with end-to-end technology solutions at scale.At New Era, you’ll join a team-oriented culture that prioritizes your personal and professional development. Work alongside industry-certified experts, acce...",
    "url": "https://remotive.com/remote-jobs/software-dev/enterprise-identity-engineer-2007860",
    "salary": "$76,000 - $90,000 usd",
    "job_type": "Full-time",
    "posted_date": "2025-05-13T14:51:04",
    "source": "remotive_api",
    "external_id": "2007860",
    "fetched_at": "2025-05-28T00:01:11.781935"
  },
  {
    "title": "Python Developer",
    "company": "PEARL GmbH",
    "location": "LATAM",
    "description": "Overview Work Arrangement: Remote| 9:00 AM – 6:00 PM ESTJob Type: Full-timeSalary: Competitive base salary in USDWork Schedule: 40 hours per week About Pearl Talent Pearl works with the top 1% of candidates from around the world and connects them with the best startups in the US and EU. Our clients have raised over $5B in aggregate and are backed by companies like OpenAI, a16z, and Founders Fund. They’re looking for the sharpest, hungriest candidates who they can consistently promote and work wi...",
    "url": "https://remotive.com/remote-jobs/software-dev/python-developer-2007862",
    "salary": "competitive base salary in usd",
    "job_type": "Contract",
    "posted_date": "2025-05-13T14:51:02",
    "source": "remotive_api",
    "external_id": "2007862",
    "fetched_at": "2025-05-28T00:01:11.781937"
  },
  {
    "title": "AI Software Engineer",
    "company": "Buyers Edge Platform",
    "location": "Worldwide",
    "description": "Who are we? Buyers Edge Platform stands at the forefront of revolutionizing the foodservice industry through technology, purchasing power and partnerships. We are dedicated to empowering stakeholders across the entire foodservice ecosystem (operators, distributors, manufacturers) with efficiency and unprecedented visibility. With a diverse portfolio of over a dozen brands, our mission is clear: to reduce costs, streamline the foodservice supply chain, and propel the industry from manual to autom...",
    "url": "https://remotive.com/remote-jobs/software-dev/ai-software-engineer-2007924",
    "salary": "competitive compensation",
    "job_type": "Full-time",
    "posted_date": "2025-05-13T14:51:01",
    "source": "remotive_api",
    "external_id": "2007924",
    "fetched_at": "2025-05-28T00:01:11.781939"
  },
  {
    "title": "Senior Backend Developer (Node.js)",
    "company": "Tether",
    "location": "Worldwide",
    "description": "Join Tether and Shape the Future of Digital FinanceAt Tether, we’re not just building products, we’re pioneering a global financial revolution. Our cutting-edge solutions empower businesses—from exchanges and wallets to payment processors and ATMs—to seamlessly integrate reserve-backed tokens across blockchains. By harnessing the power of blockchain technology, Tether enables you to store, send, and receive digital tokens instantly, securely, and globally, all at a fraction of the cost. Transpar...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-backend-developer-node-js-1984510",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-13T12:46:44",
    "source": "remotive_api",
    "external_id": "1984510",
    "fetched_at": "2025-05-28T00:01:11.781940"
  },
  {
    "title": "Senior Software Engineer C++",
    "company": "Tether",
    "location": "Worldwide",
    "description": "Join Tether and Shape the Future of Digital FinanceAt Tether, we’re not just building products, we’re pioneering a global financial revolution. Our cutting-edge solutions empower businesses—from exchanges and wallets to payment processors and ATMs—to seamlessly integrate reserve-backed tokens across blockchains. By harnessing the power of blockchain technology, Tether enables you to store, send, and receive digital tokens instantly, securely, and globally, all at a fraction of the cost. Transpar...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-software-engineer-c-1996157",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-11T12:45:49",
    "source": "remotive_api",
    "external_id": "1996157",
    "fetched_at": "2025-05-28T00:01:11.781946"
  },
  {
    "title": "iOS Developer",
    "company": "nooro",
    "location": "USA",
    "description": "WHO ARE WE? At nooro, we're revolutionizing pain management for seniors. Our platform is transforming how older adults engage with pain management at home. We're on a mission to make wellness more accessible and effective through technology. Check our website here: https://nooro-us.com/ We're a fast-moving startup that works on quick iteration and bold decisions. Our team is lean, agile, and empowered to make meaningful impacts daily. If you enjoy a dynamic environment where ideas become a reali...",
    "url": "https://remotive.com/remote-jobs/software-dev/ios-developer-1956455",
    "salary": "$60k-$130k (depending on experience)",
    "job_type": "Full-time",
    "posted_date": "2025-05-09T21:15:41",
    "source": "remotive_api",
    "external_id": "1956455",
    "fetched_at": "2025-05-28T00:01:11.781948"
  },
  {
    "title": "Senior React Full-stack Developer",
    "company": "Lemon.io",
    "location": "Northern America, LATAM, Europe, UK, Australia, New Zealand, Philippines, Indonesia, Papua New Guinea",
    "description": "Are you a talented Senior Developer looking for a remote job that lets you show your skills and get decent compensation? Look no further than Lemon.io — the marketplace that connects you with hand-picked startups in the US and Europe. What we offer: The rate depends on your seniority location, level, skills and experience. We've already paid out over $11M to our engineers. No more hunting for clients or negotiating rates — let us handle the business side of things so you can focus on what you do...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-react-full-stack-developer-2005847",
    "salary": "",
    "job_type": "Full-time",
    "posted_date": "2025-05-06T13:41:54",
    "source": "remotive_api",
    "external_id": "2005847",
    "fetched_at": "2025-05-28T00:01:11.781950"
  },
  {
    "title": "Senior Shopify Developer",
    "company": "Proxify",
    "location": "CET +/- 3 HOURS",
    "description": "The Role: We are looking for a Senior Shopify Developer for one of our clients. You are a perfect candidate if you are growth-oriented, you love what you do, and you enjoy working on new ideas to develop exciting products and growth features. What we are looking for: Broad shop construction, launch, and maintenance expertise, as well as a general understanding of the admin system. Proven skills in HTML5, CSS3, and JavaScript, as well as a thorough grasp of the DOM. Previous experience working wi...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-shopify-developer-1383531",
    "salary": "$50k-$80K",
    "job_type": "Full-time",
    "posted_date": "2025-05-05T15:30:56",
    "source": "remotive_api",
    "external_id": "1383531",
    "fetched_at": "2025-05-28T00:01:11.781952"
  },
  {
    "title": "Senior Software Engineer",
    "company": "Contra",
    "location": "Canada",
    "description": "Who We Are And What We Do: Contra is a network of independent creatives, connecting you with the talent and tools to get work underway. Our platform offers all the necessary tools for discovering, hiring, onboarding, managing, and paying flexible talent. Why Join Contra's Journey? Contra is building the platform for the future of work. People, companies, and agencies are looking to adopt more flexible working styles, and we are leading the way, with a network of over 1M freelancers and 50k clien...",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-software-engineer-1997611",
    "salary": "CAD 170k-200k",
    "job_type": "Full-time",
    "posted_date": "2025-05-01T18:03:50",
    "source": "remotive_api",
    "external_id": "1997611",
    "fetched_at": "2025-05-28T00:01:11.781954"
  },
  {
    "title": "No Code Developer",
    "company": "Contra",
    "location": "Worldwide",
    "description": "We’re looking for a skilled No-Code Developer to help us design, build, and launch functional, responsive websites and automation workflows—without writing a single line of code. If you’re experienced with tools like Webflow, Airtable, and Zapier and have a strong eye for clean design and user experience, we’d love to work with you. 🚀 What You’ll Do Design and build websites using modern No-Code platforms Translate designs and concepts into fully functional sites Customize and optimize for respo...",
    "url": "https://remotive.com/remote-jobs/software-dev/no-code-developer-1997615",
    "salary": "$55 - $65/hr • 20 hrs/wk",
    "job_type": "Part-time",
    "posted_date": "2025-04-29T17:06:15",
    "source": "remotive_api",
    "external_id": "1997615",
    "fetched_at": "2025-05-28T00:01:11.781957"
  },
  {
    "title": "Senior Ruby on Rails Developer",
    "company": "Proxify",
    "location": "CET +/- 3 HOURS",
    "description": "The Role: We are looking for a Senior Ruby on Rails developer for one of our clients. You are a perfect candidate if you are growth-oriented, you love what you do, and you enjoy working on new ideas to develop exciting products and growth features. What we are looking for: 5+ years of Ruby on Rails development experience. Strong in Ruby, Rails, and RESTful APIs. Proficient in database design and SQL. Experience with testing (e.g., RSpec) and Git. Solid understanding of HTML, CSS, and JavaScript....",
    "url": "https://remotive.com/remote-jobs/software-dev/senior-ruby-on-rails-developer-1606658",
    "salary": "$40k - $75k",
    "job_type": "Full-time",
    "posted_date": "2025-04-28T15:56:13",
    "source": "remotive_api",
    "external_id": "1606658",
    "fetched_at": "2025-05-28T00:01:11.781959"
  }
]